[{"movie_name": "Avengers: Infinity War", "movie_year": "2018", "actors": ["Robert Downey Jr.", "Chris Hemsworth", "Mark Ruffalo"], "director": "Anthony Russo,", "writers": ["Christopher Markus", "Stephen McFeely"], "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "review_rating": "8.9", "keywords": ["death of recurring character", "supervillain", "super villain", "superhero", "iron man character"], "user_review_count": "2321", "critic_review_count": "374", "synopsis": "SPOILER: Thanos and his Children - Proxima Midnight, Ebony Maw, Corvus Glaive and Cull Obsidian - attack the Asgardian ship in search of the Space Stone, which is housed in the Tesseract that Loki had stolen before Asgard's destruction. With Thanos already possessing the Power Stone after decimating Xandar, Thanos' army swiftly defeats the Asgardians. After a futile counter-attack from the Hulk, Loki offers the Tesseract to Thanos in exchange for Thor's life - only to be killed himself when Thanos anticipates Loki's attempt to betray and kill him. Heimdall uses the power of the Bifrost to send Hulk to Earth before Glaive kills him. Thanos and his Children then depart just as the ship self-destructs, leaving a mourning Thor behind.Hulk crash lands at the Sanctum Sanctorum and is reverted back to Bruce Banner, who informs Stephen Strange and Wong about Thanos' impending arrival. Strange and Banner retrieve Tony Stark and brief him about the Infinity Stones and Thanos. Maw and Obsidian arrive in New York to seize the Time Stone from Strange, and Stark, Strange, Wong and Peter Parker confront them as Banner is unable to transform into the Hulk, having been traumatized by his defeat by Thanos. Maw incapacitates and captures Strange; Stark and Parker pursue his spaceship while Wong stays behind to protect the Sanctorum and Banner contacts the rest of the Avengers.In Scotland, Wanda Maximoff and Vision, who has the Mind Stone in his forehead, are ambushed by Midnight and Glaive, but Steve Rogers, Natasha Romanoff and Sam Wilson fend them off. They decide to seek shelter in the Avengers Facility in Upstate New York, where they meet James Rhodes, who is once again mobile with new bionic leg braces. Vision proposes that Maximoff destroy the Stone in his forehead to keep Thanos from retrieving it at his expense. Rogers suggests that they travel to the one place that has the technology to safely remove the stone from Vision without killing him: Wakanda.Thor is rescued by the Guardians of the Galaxy, who had picked up the Asgardian ship's distress call. Thor guesses that Thanos would be after the Reality Stone, which is in the possession of the Collector in Knowhere, but first he must retrieve a new weapon from the dwarven planet of Nidavellir, where the only forge that can create such a weapon exists. Thor orders Rocket with him to Nidavellir, while Peter Quill, Gamora, Drax and Mantis travel to Knowhere. In Knowhere, Thanos ambushes the Guardians, having already retrieved the Reality Stone and created an illusion of an intact Knowhere to trap them. He captures Gamora. Thanos reveals that he knows that Gamora already knows the location of the Soul Stone after prying information from a tortured Nebula. Nebula escapes and signals the remaining Guardians to meet her on Titan, Thanos' home world. Thanos and Gamora travel to the planet of the Soul Stone, where Red Skull, the Stone's keeper, informs him that the Stone can only be retrieved by sacrificing someone he truly loves. Despite his reluctance, Thanos tearfully throws Gamora to her death, which grants him the Soul Stone.Stark and Parker rescue Strange from Maw's torture, and throw Maw out of the ship killing him. The three leave to confront Thanos on Titan, where they meet Quill, Drax and Mantis and form a plan to remove Thanos' gauntlet. Thanos teleports to Titan, where the group engage him hand-to-hand and manage to subdue him. Mantis is able to calm Thanos while Peter and Tony attempt to pry the gauntlet from his arm. Quill and Nebula, who arrived on Titan during the battle, deduce that Gamora is dead; an enraged Quill retaliates at Thanos, breaking the group's hold on Thanos. Thanos defeats the group, and Strange decides to surrender the Time Stone to save Stark. Thanos retrieves the Time Stone and departs Titan.Thor, Rocket and Groot arrive at an abandoned and desolate Nidavellir, where Eitri informs them that Thanos forced the dwarves to create his gauntlet; in return, Thanos killed all the dwarves except for Eitri. The four create Stormbreaker, an axe that serves as Thor's new weapon and grants him the power of the Bifrost. Meanwhile, the Avengers arrive in Wakanda and task Shuri to safely extract the Mind Stone from Vision. Thanos' Outrider army arrives and begins attacking Wakanda, and the Avengers alongside the united Wakandan armies led by King T'Challa mount a defense against Thanos' forces. Glaive infiltrates Shuri's lab and attacks Vision. The Outriders begin overwhelming the defending armies before Thor, Rocket and Groot arrive to help the Avengers. Midnight, Obsidian and Glaive are killed, but Thanos arrives for the Mind Stone. A tearful Maximoff destroys the still-implanted Mind Stone in Vision to prevent Thanos from retrieving it, but Thanos uses the Time Stone to reverse the event and pry out the Mind Stone from Vision, killing him. Thor attacks and drives Stormbreaker into Thanos' chest, but Thanos survives, snaps his fingers with the gauntlet before teleporting away.Thanos' goal of eradicating half of all life in the universe comes to fruition as people begin disintegrating; those include Bucky, Groot, Parker, Quill, Strange, T'Challa, Wilson, Drax, Mantis and Maximoff all dissolve into ash. In Wakanda, only Rogers, Thor, Banner, Romanoff, James Rhodes, Rocket, Okoye and M'Baku remain of the heroes. On Titan, only Nebula and Stark are left alive. Thanos awakens fully healed in another planet and watches the sunset, satisfied at having achieved his ultimate goal.In a post-credits scene, the world is in chaos as people begin dissolving into nothing; cars crash on the street and a helicopter is seen crashing into a skyscraper and exploding. Former S.H.I.E.L.D. Director Nick Fury and Deputy Director Maria Hill witness the scene on the street before they dissolve themselves. Before he vanishes, Fury manages to send a final distress signal to Captain Marvel.", "language": ["English"], "release_date": "27 April 2018", "viewer_count": "307358"}, {"movie_name": "Coco", "movie_year": "2017", "actors": ["Anthony Gonzalez", "Gael García Bernal", "Benjamin Bratt"], "director": "Lee Unkrich,", "writers": ["Lee Unkrich", "Jason Katz"], "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy", "Music", "Mystery"], "review_rating": "8.5", "keywords": ["mexico", "death", "afterlife", "day of the dead", "ban on music"], "user_review_count": "550", "critic_review_count": "357", "synopsis": "In Santa Cecilia, Mexico, Imelda Rivera was the wife of a musician who left her and their 3-year-old daughter Coco, to pursue a career in music. She banned music in the family and opened a shoe-making family business. Ninety-six years later, her great-great-grandson, 12-year-old Miguel, now lives with Coco and their family. He secretly dreams of becoming a musician like Ernesto de la Cruz, a popular actor and singer of Coco's generation. One day, Miguel inadvertently damages the photo of Coco with her parents at the center of the family ofrenda and removes it, discovering that her father (whose face is torn out) was holding Ernesto's famous guitar.Concluding that Ernesto is his great-great-grandfather, Miguel ignores his grandmother Elena's objections and leaves to enter a talent show for the Day of the Dead. He enters Ernesto's mausoleum and steals his guitar to use in the show, but becomes invisible to everyone in the village plaza. However, he can see and be seen by his Xoloitzcuintli dog Dante and his skeletal dead relatives who are visiting from the Land of the Dead for the holiday. Taking him there, they realize that Imelda cannot visit as Miguel removed her photo from the ofrenda. Discovering that he is cursed for stealing from the dead, Miguel must return to the Land of the Living before sunrise or he will become one of the dead: to do so, he must receive a blessing from a member of his family using an Aztec marigold petal that can undo the curse placed upon him by stealing Ernesto's guitar. Imelda offers Miguel a blessing but on the condition that he abandon his musical pursuits when he returns to the Land of the Living; Miguel refuses and attempts to seek Ernesto's blessing.Miguel encounters Héctor, a down-on-his-luck skeleton who once played with Ernesto and offers to help Miguel reach him. In return, Héctor asks Miguel to take his photo back to the Land of the Living so he can visit his daughter before she forgets him and he disappears completely. Héctor attempts to return Miguel to his relatives, but Miguel escapes and infiltrates Ernesto's mansion, learning along the way that an old friendship between the two deteriorated before Héctor's death. Ernesto welcomes Miguel as his descendant, but Héctor confronts them, imploring Miguel to take his photo. Miguel soon realizes that Ernesto murdered Héctor using a poisoned drink and stole the songs he had written, passing them off as his own to become famous. To maintain his legacy, Ernesto steals the photo and has Miguel and Héctor thrown into a cenote pit.Miguel realizes that Héctor is his actual great-great-grandfather and that Coco is Héctor's daughter, the only living person who still remembers him. With the help of Dante - who turns into an alebrije - the dead Riveras find and rescue them. Miguel reveals that Héctor's decision to return home to her and Coco resulted in his death, and Imelda and Héctor reconcile. They infiltrate Ernesto's sunrise concert to retrieve Héctor's photo from Ernesto and expose his crimes. Ernesto is crushed by a falling church bell as in his previous life, but the photo falls into the water and disappears.As the sun rises, Héctor is in danger of being forgotten by Coco and disappearing. Imelda blesses Miguel with no conditions attached so he can return to the Land of the Living, where he plays a song for Coco that Héctor wrote for her during her childhood. The song sparks her memory of Héctor and revitalizes her, and she gives Miguel the torn-out piece of the photo from the ofrenda, which shows Héctor's face. Elena reconciles with Miguel, accepting both him and music back into the family.One year later, Miguel proudly presents the family ofrenda - featuring a photo of the now deceased Coco and the restored photo of Héctor and Imelda - to his new baby sister. Letters kept by Coco contain evidence that Ernesto stole Héctor's songs. As a result, Ernesto's legacy is destroyed and the community honors Héctor instead. In the Land of the Dead, Héctor and Imelda join Coco for a visit to the living Riveras as Miguel sings and plays for his dead and living relatives.", "language": ["English", "Spanish"], "release_date": "24 November 2017", "viewer_count": "170464"}, {"movie_name": "Logan", "movie_year": "2017", "actors": ["Hugh Jackman", "Patrick Stewart", "Dafne Keen"], "director": "James Mangold", "writers": ["James Mangold", "Scott Frank"], "genres": ["Action", "Drama", "Sci-Fi", "Thriller"], "review_rating": "8.1", "keywords": ["x men", "marvel comics", "superhero", "mutant", "reluctant hero"], "user_review_count": "1284", "critic_review_count": "598", "synopsis": "Logan is preceded by a short film:On the streets of New York City, a man carrying groceries is suddenly accosted by a mugger. Walking upon the scene is none other than Wade Wilson, aka Deadpool (Ryan Reynolds). He hops inside a phone booth and starts changing into his costume while the mugger and victim are fighting. However, Wade takes too long to change and the victim is shot dead. Deadpool steps out of the phone booth and comments how he should have just called 911. He then lays down on the dead man's body and helps himself to a pint of ice cream from the man's bag.Logan (2017)Logan (Hugh Jackman), formerly the Wolverine, wakes up in the back of a limo, groggy and disheveled. It's the middle of the night. He stumbles out and finds a Mexican gang trying to vandalize the car. Logan calmly attempts to intervene but one of the gang members blasts him with a shotgun. Coming to a stand, Logan reveals his claws, an act that is evidently painful, but one doesn't retract all the way. He fights the gang, receiving his share of abuse as they beat him down, but manages to brutally maim and kill most of them before the rest run away.The year is 2029. Looking no older than 50, Logan has aged to over 170 years and is no longer the same fighter he once was. The adamantium in his body is slowly killing him. As a result, his body aches, it takes longer for him to heal, and he coughs up blood on occasion. Mutants are on the brink of extinction and no new ones have been born in 25 years. Logan now makes a living driving for a limo service in El Paso, Texas under his birth name, James Howlett. He also carries an adamantium bullet with him in case he ever decides to end it all.While he waits for a client at a funeral, he is approached by a woman named Gabriela Lopez (Elizabeth Rodriguez). She claims to know who he is and asks for his help, but Logan turns her away. Gabriela drives off as a young girl in the back seat stares at Logan.One morning a man enters Logan's limo, introducing himself as Donald Pierce (Boyd Holbrook). He appears to know much about Logan, saying he's aware of his unofficial participation in the killing of the gang members and alludes to Logan's side job as caretaker for one Charles Xavier just south of the border. Pierce says he knows Logan was contacted by a person of interest and claims that he only wants what Gabriela has; something she took from him. He hands Logan a card and tells him to call when he finds Gabriela again. The card reads that Donald is head of security at 'Alkali-Transigen', a biotechnological corporation. Logan drives off, furious.Logan heads into Mexico to an abandoned plant where he and the clairvoyant mutant Caliban (Stephen Merchant), an albino psychic, are taking care of Xavier (Patrick Stewart). Charles has been reduced to a shell of his former self, crippled and suffering from a degenerative brain disease which produces seizures. Thanks to his mutation, the seizures produce staggering psionic blasts which paralyze anyone within reach. Logan must administer a special serum to keep Xavier's episodes under control, though the doses often leave him confused and senile. Xavier has become broken since the loss of his school and fellow X-Men some time ago and says that Logan is just waiting for him to die.Logan argues with Caliban about obtaining enough medicine for Xavier. Caliban explains that it's hard caring for Xavier, especially when Logan won't communicate about his own needs which are more than evident to the albino. Logan storms off. Later he receives a notification for two passengers and drives to a motel. There, he comes across Gabriela again with the young girl whom Gabriela says is her 11 year old daughter, Laura (Dafne Keen). She offers Logan $50,000 to help them reach a place called 'Eden' in North Dakota en route to Canada before handing him an envelope with coordinates written on it and $20,000 inside. Logan reluctantly agrees and heads home to prepare. There, he tells Xavier that their dream of leaving and buying a boat may actually become reality.However, when he returns to the motel, he finds that Gabriela has been murdered and Laura is missing. Logan takes Gabriela's cell phone and finds she was in the process of sending him a text telling him to hurry as they've been found. Logan returns home, dejected, but is stunned to find that Laura has stowed away in the trunk of his limo. Xavier excitedly hosts the young girl and tries to convince Logan that she needs their help. However, Logan correctly predicts that she'll be found and, soon enough, Pierce comes knocking at their door. Logan claims Laura is not there and, when Pierce persists, Laura throws a pipe at his head, knocking him out. Logan tells Caliban to take Pierce out into the desert and leave him there. Caliban dresses heavily to protect his sensitive skin from the sun and carts Pierce's body away, but a squad of elites from Transigen, the Reavers, arrive. They pick up Pierce and capture Caliban.The Reavers return to the plant and two enter to retrieve Laura, who is calmly eating a bowl of cereal, while Logan and the others wait outside. After some commotion, Laura appears, throwing the head of one of the Reavers at Pierce's feet. She then steps forward, producing two adamantium claws from her hands and one from her feet and viciously attacks the Reavers. A stunned Logan finally helps her fight and flees the scene in the limo with Xavier and Laura in the backseat. Caliban is taken by the Reavers and tortured with sunlight in order to get him to use his powers to track the trio.Logan demands to know who Laura is and Xavier responds that she is very much like him. Logan looks through Gabriela's phone for clues and finds a video which reveals that she used to work for Transigen in the genetics department. However, the phone dies before the video can finish. They stop at a convenience store to stock up on supplies. The clerk (Dave Davis) attempts to stop Laura from shoplifting some chips and sunglasses but she easily flips him over and nearly claws him before Logan intervenes, saying \"Not okay\". He then takes a phone charger and cigar and leaves.That night, as the phone charges, Logan watches the rest of Gabriela's video. She had documented her role as a nurse in the genetic experimentation of new mutant children, led by Dr. Zander Rice (Richard E. Grant), with the intention of turning them into super soldiers. Using DNA from known mutants, most of whom were deceased, the children were conceived and born to anonymous mothers who would not be missed. The children, including Laura, were dubbed X-23 and raised under harsh conditions. Simple pleasures, such as birthdays, were frowned upon. The experiment was deemed a failure due to the fact that the children sustained too much emotion and often refused to follow orders. With the introduction of X-24, it was decided the children would be terminated. Rather than see them killed, Gabriela helped orchestrate an escape and the location of Eden was designated as a safe point so the children could live free in Canada. In the video's final moments, Gabriela admits that she is not Laura's mother but loves her all the same. Addressing Logan, she apologizes for lying about the total fee that she would pay him but hopes that, as her biological father, he will keep her safe. The trio enter Oklahoma City and take residence in a hotel where Logan discovers that Laura has been reading an X-Men comic book. He finds that the coordinates to Eden are included in the book and is convinced that the whole trip is a charade. Angry, he confronts Laura to Xavier's disdain and tells her the X-Men stories she's been reading are fantasized and that Eden does not exist. Logan leaves Xavier and Laura in their room and goes downstairs where he sees that the Reavers have followed them. Suddenly, everyone becomes paralyzed and Logan realizes Xavier is suffering another seizure. Having ever been the only one to partially resist the effects, Logan struggles to make it back to the room where some of the Reavers have already found Laura and Xavier. Logan kills them all before injecting Xavier with his serum, ending the paralysis, and the three escape in a new vehicle.On the road, a report goes over the incident in Oklahoma City and relates the similarity to an event that occurred in Westchester one year prior, but Logan turns off the radio. They are nearly run off the road by a robotic freight truck and swerve to avoid a pickup hauling a trailer full of horses. Xavier convinces Logan to help and uses his telepathic powers to bring the horses back. The driver introduces himself as Will Munson (Eriq La Salle) accompanied by his wife Kathryn (Elise Neal) and son Nate (Quincy Fouse). Logan then helps push their pickup out of a ditch. Kathryn offers Logan and his 'family' to have dinner with them which Xavier happily accepts.Logan is eager to leave immediately after dinner but Kathryn offers them to spend the night as it's late. Logan only agrees for Xavier's sake and carries him upstairs to bed. Seeing that their water supply has been tampered with, Will goes out to investigate and Logan tags along. They find and fix the obvious leak at the pump some distance away and are confronted by a group of thugs led by a man who owns the land. He harasses Will, saying he's been skimping on payments, but Logan hits one of the thugs in the face with his own rifle and breaks it over his knee, scaring them off.Back at the house, Xavier lies in bed and senses Logan entering the room. He tearfully pleads with him to be patient with Laura, asleep on the floor beside him, and expresses regret and remorse over what happened a year ago. It is implied that Xavier suffered a massive seizure at his school in Westchester which resulted in the deaths of most of the X-Men. He apologizes but Logan pushes his claws through Xavier's chest. Laura attacks in Charles' defense and the attacker turns out to be a clone of Logan, the X-24 model. The mutant abducts Laura and slaughters Nate and Kathryn. Upon returning, Will is struck down by the X-24 and Logan rushes upstairs to get Xavier who is just barely alive. Logan consoles him, \"It wasn't me\", as he carries him downstairs.Outside, the Reavers wait with Pierce and Dr. Rice. Caliban is confined in a surveillance van. The thugs who abused Will before arrive at the house in retaliation for their earlier humiliation but X-24 kills them all. Logan sets Xavier down in the bed of a pickup truck. Charles utters the name of their boat and dies. Bereaved, Logan engages the X-24 in a furious fight. Meanwhile, Caliban fights back against his captors and sets off two grenades, muttering the phrase his mother once told him: \"Beware the light.\" The van explodes and Pierce is thrown out while Rice escapes. Logan is nearly overpowered by the X-24 until Will rams into the mutant with his truck, pinning him against some farm equipment. Will repeatedly shoots X-24 with a shotgun and then turns the gun on Logan. However, it's out of bullets and Will collapses, dead. Logan retrieves Laura and takes her with Xavier's body and drives away. The following morning, Dr. Rice and his crew take care of the scene and inject X-24 with an agent to help him heal.Logan buries Charles in an unmarked grave in the woods while Laura watches. Afterwards, he goes back to their truck and begins smashing it in fury before passing out. Later, Logan wakes up in a clinic. The doctor (James Handy) tells Logan he knows he's a mutant and says he wants to help him, aware that the adamantium in his body is killing him. Logan refuses and leaves with Laura. He begrudgingly thanks her and she finally speaks by responding 'you're welcome' in Spanish. Logan is perplexed as to why she never spoke before, but Laura begins rattling in Spanish the names of her friends from Transigen. She tells Logan they must meet up with them in Eden and presses him with such persistence that Logan finally concedes, but only to prove Eden doesn't exist.The two just barely make it and Logan is drained to the point of unconsciousness, so much that Laura had to drive the remaining miles there. At a cliff, a lift is dropped for Logan so they can ascend and he and Laura are finally able to rest along with the remaining children led by Rictor (Jason Genao). The kids prank Logan by shaving his beard in his sleep to more closely resemble how he looked in his youth, but Logan is not amused. Rictor gives Logan a serum that was used on them in Transigen to help him re-energize and heal, but he warns Logan not to use it all at once. Logan then tells Laura that he's done his job in delivering her to Eden and emotionally explains that everyone he cares about dies and it's better he leaves. Laura bitterly responds that she should be fine, then.In the morning, the children are gone and Logan is about to leave when he sees that the Reavers have caught up to them, tracking the children. Logan runs to intercept them as the Reavers pick off the children one by one. Despite using their powers, the children are outnumbered. Injecting all of the healing agent at once, Logan kills most of the Reavers and confronts Dr. Rice who has rounded up the children and is holding them at gunpoint. Rice reveals that he is actually the son of the man killed by Wolverine when he escaped the Weapon X project. Rice admits responsibility for the extinction of mutants thanks to a virus developed by Transigen that was seeped into food supplies. Before he can continue his monologue, Logan shoots him dead in a desperate move and goes after Pierce. However, X-24 is released and Logan fights his clone once more. Seeing that Pierce is in complete control of X-24, the children gang up on him and use their collective powers (electrocution, freezing, plant manipulation, etc.) to kill him.As the healing agent in Logan's body wears off, he becomes overpowered by his younger clone until X-24 finally impales Logan on a dead tree limb. Laura then uses the adamantium bullet Logan carried with him to blow X-24's head off. She runs to Logan and cuts him down from the tree, but Logan's wounds aren't healing. Logan tearfully tells Laura to run with the others; they're free. She cries, calling him 'Daddy' and Logan responds, \"So...this is what it feels like\" before he dies. The children bury Logan and raise a cross at the head of the grave as Laura recites from a Western, the movie Shane (1953), that she and Xavier watched in the Oklahoma hotel:\"A man has to be what he is, Joey. Can't break the mold. There's no living with the killing. There's no going back. Right or wrong, it's a brand. A brand that sticks. Now you run on home to your mother... you tell her everything's alright. There are no more guns in the valley.\"The children then leave, their future uncertain but free. Laura takes the cross on Logan's grave and tilts it sideways, to look like an X.", "language": ["English", "Spanish"], "release_date": "3 March 2017", "viewer_count": "478869"}, {"movie_name": "La La Land", "movie_year": "2016", "actors": ["Ryan Gosling", "Emma Stone", "Rosemarie DeWitt"], "director": "Damien Chazelle", "writers": ["Damien Chazelle"], "genres": ["Comedy", "Drama", "Music", "Musical", "Romance"], "review_rating": "8.1", "keywords": ["pianist", "aspiring actress", "jazz musician", "movie set", "jazz music"], "user_review_count": "1370", "critic_review_count": "644", "synopsis": "During the opening credits, the movie we are viewing is said to have been filmed in CINEMASCOPE (like the old-time musicals) and then the screen expands from box format to wide. We find ourselves on the 105/110 interchange in Los Angeles. People listen to various forms of music in their cars. Then one random woman (Reshma Gajjar) gets out of her vehicle and starts singing and dancing (ANOTHER DAY OF SUN) to camera (à la a musical), about how great it is being in sunny California. Someone else exits his car and joins her. Pretty soon, everyone has left their car and is singing the song while dancing in the street or on the cars that are parked via the traffic jam, everything synchronized for the full-length musical number.The song ends and everyone gets back in their cars. We are told it is WINTER. Traffic finally begins to move. Inside her Toyota Prius, Mia (Emma Stone) appears to be talking to someone on the phone. In his classic car, Sebastian (Ryan Gosling) honks at her to move. We realize she isn't talking to anyone but is practicing for an upcoming audition. Sebastian goes around her, glaring, while she flips him off. She then murmurs that she should probably move as she's obstructing the traffic flow.Mia works at a coffee shop on the Warner Bros lot, serving the employees of the studio. When a movie star comes in for coffee, the manager tells her it's on the house so she puts her money in the tip jar instead. Mia watches in awe as the movie star gets on a golf cart, being escorted to set. Then Mia's phone goes off, reminding her that she has an audition to get to. Mia rushes off so she won't be late and collides with a customer, spilling coffee all over her shirt. When Mia gets to the audition, she is wearing a jacket over her blouse. She does her reading, giving a really honest performance where she breaks into tears. But it goes unnoticed as someone appears in the window with a message. The casting directors interrupt Mia's audition while they talk to an assistant who tells them someone has called for them, which they say to relay that they'll return the call shortly. Mia is thanked even though they have neglected to watch her performance. She leaves the casting office and into the waiting area where everyone looks like her. Then she gets into the elevator where two other girls look like her and are wearing similar clothes, all presumably there for the same audition.Mia returns home to the house she lives with three other aspiring actresses named Tracy (Callie Hernandez), Alexis (Jessica Rothe) and Caitlin (Sonoya Mizuno). They ask how her audition went but she doesn't want to discuss it. They are all going out to a Hollywood party at the home of someone in the film industry and suggest she goes along. She is reluctant but through a their persuasion in song (SOMEONE IN THE CROWD), Mia's roommates point out that someone might discover her if she attends and she can ascend from being just someone in the crowd. We see the party in a classic movie musical montage with close-ups of champagne being poured and creepy older men hitting on Mia. Time moves in slow-motion and the guests ballroom dance around her. The night has proven uneventful and Mia returns to her car only to realize she has parked in a tow away zone and her car is gone. She is forced to walk in heels down the canyon into the city. She walks around Hollywood and is distracted when she hears a beautiful jazz song being played on piano. It entices her to step into a restaurant/night club called Liptons, where she sees Sebastian playing the song.We flashback to earlier in the day, when Sebastian is laying on his horn behind Mia in traffic. After he gets around her, Sebastian drives his car to a coffee stand. Across the street, he watches a club open for the day, that advertises Tunes & Tapas. He goes home to his run-down apartment, and his sister is there. He chastises her for putting her feet on a stool which he took from the street after a jazz club closed down, citing that one of his favorite jazz musicians had sat on it. In their conversation, it's evident that he loves jazz music and he tells her how his old club was closed down and turned into the Samba/Tapas place. His sister points out that all his bills are overdue and that he needs to start making money.Later, Sebastian arrives at Lipton's for a piano gig. He talks to the club's manager (J.K. Simmons) about whether he can do some of his choices for songs. The manager refuses. He asks if he can do one as requested and then one of his own and is told no. He asks if he can do two as requested and then one of his own. The manager tells him all the songs should be as requested. So he begins to play Christmas songs, begrudgingly, as the patrons ignore him. After several holiday tunes, he begins to play his own piece. As fantasy, the lights in the club dim and he plays the piano in a spotlight. The piece (MIA & SEBASTIAN'S THEME) is beautiful. This is when Mia has stepped into the club. When Sebastian finishes, the fantasy fades and the lights come back up. The manager pulls him aside and tells him he's fired. Sebastian tries to convince him to give him another chance but is denied. Mia watches this whole exchange. As he passes her, she tries to tell him how moved she was by his music but he gives her a dirty look and pushes past her. This takes her aback and she is left speechless.We're told it's now SPRING. We see a montage of Mia auditioning for different roles: Mia auditions again first for the role of a doctor, where she has to recite jargon that she doesn't understand; then the role of a police officer, reciting jargon she doesn't understand; and then she reads the role of a white woman trying to educate inner-city high school students, with the casting assistant reading the lines (''Why you trippin'?'') opposite her in monotone.Mia ends at up at a pool party while an '80s cover band plays ''Take On Me'' by A-Ha. Mia is introduced to a young man who is a writer. He immediately goes into a spiel about how his career is blowing up and he's on everyone's radar; she excuses herself and ventures over to the band, only to see Sebastian is the keyboardist, wearing a hot red track suit akin to '80s fashion. The singer asks if anyone has any requests. She shouts out ''I Ran.'' Sebastian gives her a disapproving look, as the song only requires him to play the key-tar. The band plays ''I Ran'' by A Flock of Seagulls' with the lyrics ''I never thought I'd meet a girl like you'' and ''I ran, I ran so far away.'' After their set, Sebastian finds Mia and tells her she can't request ''I Ran'' because he's a serious musician. She playfully mocks his outfit and says she needs his wardrobe for an audition she has that week, for the role of a Serious Fireman. He asks what she does in life that puts her so high above him to critique, and she tells him she works at a coffee shop on the Warner Bros. lot. He chastises her for being just a barista, yet talking down to him, but is then called back to the band for another set.After the event, the writer tries chatting Mia up again. She sees Sebastian leaving and calls out to him to get her keys from the valet, as a way to escape the conversation. He asks what car she drives. When she tells him it's a Toyota Prius, he notes that all the cars are Priuses. She tells him the one with the green ribbon. We cut to them walking down the canyon among parked cars. She mentions it's strange that they keep running into each other, and Sebastian agrees, wondering if it means something. Mia says she doubts it. Her remote car key fob isn't beeping. He tells her to put it under her chin to connect with the antenna, joking that it will give her cancer but she'll find her car faster so it's a fair trade-off. The two playfully bicker and then find themselves at the top of the canyon with a view of Los Angeles below, the sunset looking pink. They both joke that the view is nothing to look at. Sebastian begins singing to her (A LOVELY NIGHT) where he says it's a waste of a lovely night on two people who aren't interested in each other. Mia changes from her high heels into dance shoes and midway through she joins him in the duet. They move from singing to dancing together. When the song ends, she gets a call from Greg, who turns out to be her boyfriend. She then puts the fob under her chin and hears a chirp. She gets to her car and asks if he wants a ride. He says, no, he's parked just up the hill. She drives away downhill. He watches her go and then also heads downhill, walking a long distance back to his car, which it turns out was parked right outside the house where the party was held.Mia is back at work at the coffee shop. A snooty woman asks her if a pastry is gluten-free. Mia tells her no. The woman demands a refund. She tells her she has to get her manager to approve that. When she approaches the manager, she is told that she has to work Friday, despite having an audition. She goes back to the counter and Sebastian is there; the only info he had about her was where she worked. She asked how he got onto the lot and he said he hightailed it past security and might need to hide in the restroom for a little bit. He asks when she's getting off work and she tells him in ten minutes. The lady who wants the refund demands service so Mia tries to take care of it at the register before realizing she still needs approval.Sebastian and Mia leave the cafe and walk along the lot; they pass many different sets filming varied scenes. They are stopped and directed around a live shoot, which prompts Sebastian to say they film movies on his street all the time. He asks Mia why she wanted to be an actress. She says her aunt was an actress and when she'd visit Mia in Boulder City, Nevada, they'd go across the street to the library and check out old movies. She used to write plays and put on productions and always wanted to act. As they continue walking past the stages on the Warner Bros. lot, Mia then tells him about her last audition for a show that is ''Dangerous Minds'' meets ''The O.C.'' He suggests that she write her own material so she doesn't have to suffer at auditions, citing that Louis Armstrong did this. She confesses that she doesn't like jazz music. This inspires him to take her to a jazz club called The Lighthouse. As the band plays, Sebastian tries to explain to Mia his love for jazz, and why he thinks jazz is great. He also tells her that jazz is dying, and his dream is to open his own jazz club where they play whatever they want, whenever they want. Mia returns a missed phone call in a quiet corner of the club, and discovers she has a callback. Sebastian asks what it's for and she said it's the ''Dangerous Minds/O.C.'' show but it's not as bad as she made it out to be now that she has a callback. It's more like ''Rebel Without a Cause.'' He quotes the movie, but she doesn't know what he's referencing, and he realizes she hasn't actually seen the film. He tells her it's playing at the Rialto and they should see it together later that week. She agrees and they say goodbye.Sebastian is then seen walking along a pier at sunset. He sings (CITY OF STARS) as he finds a man's hat on the pier, returns it to the owner, and spontaneously dances with the man's wife.Mia goes to the callback for the show. One casting director texts on her phone while the other one just looks at her head shot instead of her. After she reads one line, he tells her \"That's enough\". She suggests doing it a different way but he won't let her. She is discouraged as she leaves and drives back home, but on her way she passes the Rialto, and begins to smile. Back at home, Mia is getting ready to go to the Rialto when her boyfriend, Greg (Finn Wittrock) arrives and reminds her they're going to dinner with his brother who just got into town. She doesn't have Sebastian's contact info so she isn't able to postpone their movie date.Sebastian arrives at the theater, and waits outside for Mia. Meanwhile, Mia is at dinner while Greg has pompous conversation with his brother and his brother's date about all the exotic places they've traveled to. Mia looks up at the speaker, which begins playing MIA & SEBASTIAN'S THEME. She apologizes to Greg and leaves the restaurant, running toward the movie theater in heels. By this point, Sebastian has gone inside and the movie has already begun. Mia can't find Sebastian in the darkened theater so she stands up on the stage to scan the crowd, and Sebastian stands up once he notices her there. They watch the movie together, with the scene at the Griffith Observatory on the screen. Their hands slowly drift closer and closer until they touch. They hold hands. He leans in to kiss her and then the film breaks. The lights turn on and the moment is interrupted. Mia has an idea for a fun alternative.The two end up at the Griffith Observatory, driving into the scene with a shot recreated from the film we saw moments before. They find an unlocked door around the back, and venture inside. They begin to dance around the halls and finally end up in the planetarium. Suddenly they float up to the dome ceiling, which is lit up with stars and find themselves in the stars. They dance in outer space, until they come back down to earth and finally have their first kiss.It's now SUMMER. Mia and Sebastian are dating. She is writing a play, as Sebastian suggested. Her roommates ask for parts but she tells them it's a one-woman show. Sebastian arrives at her home but instead of coming to the door, he lays on his horn until she goes outside, annoying her roommates. What follows is a montage of the two of them on dates throughout the city, ending with the two of them at The Lighthouse, where Sebastian plays the piano and Mia dances with the other patrons. They sit down at a table together and are interrupted by a friend of Sebastian's, Keith (John Legend) who he had previously been in a jazz band with. Keith says his new band is looking for a piano player, and it pays, but Sebastian declines.Back at Sebastian's apartment, Mia finishes performing her one-woman show for him, and he tells her it's incredible. She then shows him a logo for his club she made. She wants him to call it SEBS and he compliments that she used a music note for the apostrophe but he is set on the name Chicken on a Stick as an homage to jazz musician Charlie Parker, who got his nickname Bird because he loved eating chicken.Later, Mia is on the phone with her mother. She is being asked about Sebastian and defensively tells her mom that he's going to open a jazz club but admits he doesn't have the money yet. She is insistent he is saving up though, even though he doesn't have a steady gig. Overhearing this, Sebastian is lost in his thoughts.Sebastian decides to try out the gig with Keith and his band. Keith says they have a record deal, and a tour set up, and they can pay him $1,000 a week, plus a cut of tickets and merchandising. Sebastian is momentarily speechless at this. They rehearse a song that begins as the type of jazz Sebastian is used to, then Keith adds in electronic, modern noises and Sebastian is thrown off, but he tries to continue playing. Keith pulls Sebastian aside afterwards and notes that Sebastian has always been difficult because he's a traditionalist but young people don't like that kind of jazz music it has to be modernized to appeal to them and Sebastian is foolish to cling to the antiquated past instead of focusing on the future of jazz.We see Sebastian at home playing piano. Mia comes home, and Sebastian begins singing (CITY OF STARS) as he plays. Mia joins him on the piano bench and joins in, making the song a duet. As the piano music continues, we see a montage of changes in each of their lives. Mia quits her day job as a barista, and arranges a theater rental for her one-woman show. Sebastian signs with Keith's band, and proceeds to tour and do press events with them. We see that Mia is moving in with Sebastian, and selling some of her stuff, and working on her one-woman show, while Sebastian is out performing. They seem to be growing apart, as Mia is shown staying up late waiting for him, then Sebastian coming in after she's fallen asleep, and then Mia alone in the kitchen the next morning. The montage ends with a flashback of the two of them finishing their CITY OF STARS duet on the piano bench together.Mia attends a concert for Keith and Sebastian's band, The Messengers. What begins as a jazz song turns into a dance number with samples of jazz elements (START A FIRE). The massive crowd of young people love it as it sounds very modern and radio-friendly. But Mia is surprised that Sebastian doesn't mind selling out when he is so particular in the style of music he loves. She searches his face for disapproval but he kind of shrugs the experience off as a non-issue. As the song and the crowd grows more frenzied, Mia is pushed to the back of the crowd, and fades out of Sebastian's view by the end of the song.It's now FALL. Mia drives by the Rialto, where they saw ''Rebel Without a Cause'' and notices it's been closed. She emails a handful of people about her show, then on her way home she leaves a message for Sebastian, saying she misses him and that they haven't talked in a while as he's been on the road touring. However, when she gets home Sebastian is there to surprise her, having come back into town for just one night to see her. Over dinner, Mia notes that she hasn't seen him in months and is so glad they're together again. He suggests she joins the band in Boise for their next gig. She politely declines, saying she has to stay in Los Angeles because her show is two weeks away from its opening night. He points out it's a one-woman show and she can rehearse anywhere. She replies that the theater is set up for her in L.A. She notes that she is terrified that it won't go well, noting that while he doesn't seem to have concerns with performing, she has a lot of fear of whether people like her. She asks when the tour ends. He tells her there's no set amount of time but when it's done, they will then begin recording the record and then start another tour to promote the record -- the whole thing could be years. She asks him if he even likes the music they're doing. He is surprised by this and notes that the music is fine. Mia presses that he loves old school jazz. He doesn't understand why she's debating about his band she pressured him to make money to start a club and he went out and did that. She asks why he can't just begin focusing on the club with the money hes already earned. He tells her he's now part of something that is a success and that's what every musician strives for. Sebastian suggests she's surprised that the band would be successful because she suspected it would fail. He then adds that she probably doesn't want him to stay in the band to keep him down on her level (since she hasn't had much success as an actress). She asks if hes serious. He says yes. This moves Mia to tears and she leaves. Sebastian realizes the dinner has been burnt in the oven.The day comes for Mia's one-woman show. Sebastian has promised to be there since he's in L.A. practicing with his band. As he heads out after practice, Keith reminds Sebastian of the photo shoot they have that night, for the album artwork. Sebastian didn't know it was that night and we realize he's going to miss Mia's show.Mia performs her one-woman show across town, while Sebastian is photographed by an obnoxious photographer who asks him to bite his lip and lower his glasses to his nose. Mia's show ends and we see that only about ten people are in the audience. To add insult to injury, when she goes backstage, she can overhear people complaining that Mia isn't a very good actress and the show was bad.Sebastian gets to the theater after it's closed but in time to run into Mia leaving. He apologizes for missing the show. She is upset that no one showed up and has lost faith in herself. She tells him her desire to be an actress was probably just a pipe dream and she's wasted six years of living in L.A., never realizing until now that she wasn't good enough to be an actress. He tries to encourage her but she points out she can't even pay back the theater because she had no ticket sales. She tells him she's got to regroup and is going home. He thinks she means her home in L.A. but she tells him she means home home, a.k.a. Nevada.Mia drives back to Nevada and moves back in with her family. Inside her childhood home, Mia sees all the acting paraphernalia that decorated her room. Time goes by and Sebastian is in his apartment in L.A. He receives a phone call, someone asking for Mia. He tells her she is no longer accessible. The woman on the phone says she was told that this was the only number she could possibly reach her after she couldn't reach her through her home number. She tells Sebastian she is with Amy Brandt Casting.In the middle of dinner at her parents' home, Mia is startled when someone outside lays on his car horn. Mia knows who it is immediately as this is how Sebastian would always get her attention. She goes to the window and see Sebastian across the street, with a neighbor yelling at him to be quiet.Mia joins Sebastian outside. He tells her that a casting director who called him was one of the ten people who had seen Mia's one-woman show and now wants Mia to audition for a movie the next day at 5 p.m. Mia isn't sure if she wants to travel all the way back to L.A. to get her heart broken again. Sebastian tells her hell be outside her home at 8 a.m. if shes there, he'll drive her the five hours to Los Angeles; otherwise, he'll go back without her. She asks how he found her and he points out it's the house across from the library (she had mentioned this in the story about her aunt inspiring her to become an actress).Sebastian returns the next morning and parks outside of her house but she's not there. He starts to drive away and then Mia steps into frame, telling him she was delayed because she got them coffee. She hops in the car and they drive to California. He takes her to the audition which now is just them in the waiting room, unlike her previous experiences. She is immediately called into the audition room, where both Amy Brandt and her assistant are friendly and happy to see her. Mia is told that the film will have a three-month rehearsal and then a four-month shoot in Paris. There is no script, as they say it will be built around the lead actress, so for her audition, they ask her to tell her a story. She thinks for a bit and then begins to tell them about how her aunt lived in Paris once. This monologue turns into a song, AUDITION (THE FOOLS WHO DREAM), about how Paris is the place for dreamers.Mia and Sebastian go back to Griffith Park to catch up after their absence from each other. He asks how the audition went but she is afraid to be positive and get her hopes up. Mia asks Sebastian where they are now. He tells her Griffith Park but admits he's joking; he tells her he doesn't know where their relationship stands but he doesn't want to be the one to keep her from her dream. He is confident she will get the part and she has to devote all of herself to the opportunity, just like he did with his music. And that doesn't include him.We see a palm tree and are told it's WINTER. But then we pull back to see it's actually a scrim with a palm tree and were on the Warner Bros. lot. We're told its FIVE YEARS LATER. Mia goes into the same coffee shop she used to work in. The new manager and employee are a bit star-struck and tell her the coffee's on the house. Like the movie star in the beginning of the film, Mia puts the money she intended to pay for the coffee with in the tip jar and then goes outside to a golf cart, where shes chauffeured to a set. Meanwhile, we see Sebastian in a small jazz club, testing out a recently tuned piano and talking with an employee about how business is.Mia goes to an expensive home and greets her husband who is revealed to not be Sebastian but David (Tom Everett Scott). She is also shown to have a young daughter now. In another part of town, Sebastian arrives back at his home, where he is clearly better off than he was five years ago, but he does not appear to be living with anyone. He cooks lunch for himself alone.Later that evening, a babysitter watches Mia and David's daughter, and they go out to an event, supporting a colleague in the industry. We also see Sebastian arriving at his jazz club, walking past a giant poster advertising Mia's newest film on the side of his building. Mia and David get stuck in gridlock traffic with no cars moving, and Mia notes that this is what she doesn't miss about the city, letting us know she's bi-coastal but based mostly in New York. She suggests that David exit the freeway and they go out to dinner instead.After dinner, Mia is walking to their car but the sound of jazz music convinces David to scope out a nearby jazz club. He asks if Mia wants to check it out and she agrees. As they walk down into the club, Mia sees the name of the club on a neon sign - it says SEB'S. Inside, the club is packed with people as the band is finishing a song. Sebastian goes onstage to welcome the crowd and thank the band. Sebastian notices Mia in the crowd, temporarily losing his cool demeanor. He takes the spot of the pianist and begins to play MIA & SEBASTIAN'S THEME that he was playing when she first saw him. The lights dim on him and he plays, lit only by spotlight. When it's over, the lights come back up and we find him back in the restaurant where she first saw him playing the piano. Once again, Sebastian is fired by his manager (J.K. Simmons) for not sticking to Christmas tunes. He walks towards Mia who tries to compliment him but instead of brushing her off as before, he grabs her and kisses her.This begins a lengthy epilogue, a ten-minute musical number where Mia and Sebastian dance from one set to another, symbolizing what their life could have been together. It starts with all of the restaurant's patrons and the manager dancing. Then we see them running through scenes of their life, scenes we've seen before, but a little bit better. They're at the jazz club with Keith approaching Sebastian but Sebastian turns him away before he can even say hello. They're at the theater where Mia performs her one-woman show, but the audience is full and they love it, and Sebastian is there cheering for her the loudest. They leave the theater and end up on an empty soundstage, and as they walk along it becomes the soundstage on the Warners Bros. lot with people dancing on a re-creation of the 105/110 interchange while a camera crew films. Amy Brandt appears to bring Mia in for her audition, and she and Sebastian embrace when she gets the part. They're both go to Paris with Mia filming a movie and Sebastian playing jazz. They end up getting married. Now we see them as a couple, with her returning home but it's a more humble abode than her movie star reality. Instead of David and her daughter, it's Sebastian and her son. They leave the baby with a babysitter and end up in the same gridlock traffic. Mia now suggests to Sebastian that they pull off the highway and go to dinner instead. She stops by their parked car but he leads her into the jazz club. They find the same seats that Mia and David found but now it's Sebastian next to her while they watch a pianist play on the stage. Sebastian and Mia seem closer and more affectionate than she does with David. But then the song ends and she's next to David with Sebastian onstage at the piano -- it was all a fantasy.The crowd applauds, loving the song. David asks Mia if she wants to stick around for another. She contemplates the question but then finally says no. The two leave and she pauses at the door, looking back to make eye contact with Sebastian. He looks at her, and then very slightly smiles and nods his head. She smiles back at him, and turns to leave. Sebastian takes a moment, then begins playing with his band.", "language": ["English"], "release_date": "16 December 2016", "viewer_count": "371582"}, {"movie_name": "Gone Girl", "movie_year": "2014", "actors": ["Ben Affleck", "Rosamund Pike", "Neil Patrick Harris"], "director": "David Fincher", "writers": ["Gillian Flynn", "Gillian Flynn"], "genres": ["Crime", "Drama", "Mystery", "Thriller"], "review_rating": "8.1", "keywords": ["disappearance", "missing person", "murder suspect", "based on novel", "husband wife relationship"], "user_review_count": "1215", "critic_review_count": "602", "synopsis": "Nick Dunne (Ben Affleck) is stroking the hair of his wife Amy (Rosamund Pike), saying through a voiceover that he'd like to crack her skull and pick apart her brain to answer that eternal question married couples have: What are you thinking?July 5, 2012Nick takes out the garbage early in the morning, and looks around at the quiet neighbourhood. He then goes to a bar he co-owns with his sister Margo (Carrie Coon). He brings her a Mastermind board game that she throws in with a pile of others. He asks for a drink, and she pours one for each of them. It's the morning of Nick and Amy's 5th wedding anniversary, and he expects another scavenger hunt. Nick seems distressed, not wanting to be there at all.January 8, 2005Nick and Amy first meet at a party in New York. He writes for a men's magazine and she writes personality quizzes for another. She makes a comment on the cleft of his chin making him look untrustworthy. He puts two fingers over the cleft so he'll appear more trusting. They take a walk and pass through a bakery that is getting a sugar delivery. Sugar is floating around everywhere as Nick and Amy walk through it. Nick tells Amy he has to kiss her now. He wipes some sugar off her lips and kisses her. They are later seen in bed with her lying on her back in her underwear and him performing oral sex on her.Present Day.Nick gets a call from a neighbor, telling him that his cat is outside. He returns home and calls for Amy. No answer. He goes into the living room and sees a table flipped over and the glass top is shattered on the floor. Nick screams Amy's name, startling a neighbor.Nick calls the police. Arriving at his home are Detective Rhonda Boney and Officer Jim Gilpin (Kim Dickens and Patrick Fugit). They inspect the place. Rhonda sees a small splatter of blood in the kitchen above the range. In the living room, they see a wall with pictures of \"Amazing Amy\", a book series written by Amy's parents. Rhonda comments that she loves the books and is surprised to learn that Nick is married to Amazing Amy herself.February 24, 2007Nick and Amy go to a party held by her parents Rand and Marybeth (David Clennon and Lisa Banes). It is to celebrate the latest Amazing Amy book, where Amy gets married. As Nick and Amy discuss the exhibitions at the party, it becomes clear that the parents' fictional Amazing Amy character is a dramatically \"improved\" version of their real daughter that is sold it to the public. (For example, they gave Amazing Amy a dog, but refused one for their real daughter. They made Amazing Amy a prodigy cellist when real the Amy dropped out.) Rand asks Amy to go sit with some reporters so they can interview her. She does, and they ask her mundane questions such as why she's not married yet (to which she replies that Amazing Amy has always been one step ahead of her). Nick comes in pretending to be a reporter. He asks her more personal questions, leading up to a marriage proposal - opening his notebook to reveal an engagement ring. He mentions that she has a world class vagina.Present DayNick is brought into the police station for questioning about Amy's disappearance. Rhonda and Jim find it odd that he seems rather indifferent and passive when answering questions and the fact that he doesn't know if Amy has any close friends or her blood type. He goes to call Amy's parents. Her mother asks to speak to Rhonda. In the next room, Nick finds that his father Bill (Leonard Kelly-Young) is in there after the police found him wandering around town, having left his assisted living facility (he suffers from Alzheimer's). Nick drives him back to the facility.Nick stays at Margo's house while the police inspect his home. A pregnant neighbor, Noelle Hawthorne (Casey Wilson), who claims to be Amy's best friend, comes by and asks about Amy. In the upstairs bedroom, Officer Gilpin says that he found \"it\" in the drawer of \"unmentionables.\" Detective Boney pulls out an envelope, labelled \"Clue One.\"July 5, 2009Nick and Amy have been happily married for two years. On their anniversary, another of Amy's scavenger hunts takes them to the library to have sex in a quiet area. Amy gives Nick a gift. He opens the box to find a package of very high quality bed sheets. She refers to a private joke they had about how their sex was too good for ordinary sheets. He laughs and pulls out a gift for her - the same sheets.Present DayWhen questioned about this \"clue\", Nick says Amy always prepares a treasure hunt for their anniversary. The first clue leads him and Rhonda to his office, with another envelope on his desk labelled \"Clue Two.\" Detective Boney finds a pair of red panties in the office. Nick is surprised by this discovery, as it doesn't seem directly related to the clue. The second clue mentions a brown house, but tells the detective that he doesn't understand it. Nick goes to his father's old home, which is painted blue. He arrives, but sets off the alarm. He enters the code twice to disarm the alarm, but it doesn't work. The phone rings, and it is the alarm monitoring company investigating the alarm. As he starts to explain that it's his father's house, the detectives arrive, so he figures they must be following him. He finds the third clue there but only has time to tuck it into his back pocket, hiding it from the police. The detectives question him as to why he's there. He says he comes by once a week to make sure the place doesn't burn down.Amy's parents fly in from New York as a press conference is held to spread awareness of Amy's disappearance. Nick asks others for help, but he appears emotionless. He is asked to pose next to a poster of Amy, and a photographer captures the brief moment when a smile appears on his face.Nick and Amy's parents meet with Rhonda to determine some possible suspects. Rand names an ex-boyfriend of Amy's, Desi Collings, who apparently tried to commit suicide after Amy broke up with him. They also mention a former classmate named Tommy O'Hara who was convicted of sexually assaulting Amy.People go to the volunteer center to help find Amy. One person there is Desi Collings (Neil Patrick Harris), but he leaves without saying anything. Nick tries to come off as friendly to others, but Jim doesn't buy it. Even Marybeth thinks he is acting like a \"homecoming king.\" Nick is approached in a hallway by a woman who extends her sympathy and offers to make him a chicken-Frito pie casserole. She stands next to him and takes a selfie of the two of them, telling him to say \"chicken-Frito pie.\" He makes a fake smile as she takes the photo and he immediately realizes this was a mistake and asks her to delete the photo. She refuses, and he asks her not to share it with anyone. She replies, \"I'll share it with anyone I please\" as she walks away. The photo goes viral. Consequently, the media starts analyzing Nick. TV personalities like Ellen Abbott (Missi Pyle) paint him as an unempathetic sociopath.2010Amy's diary explains how both she and Nick lose their jobs. Amy talks about the troubles they are having, then says, \"But that's all background noise.\" She says that none of it matters as long as they have each other. Then Amy tells Nick that her parents are having financial problems and asked her for her trust fund money, which is nearly a million dollars. Nick is shocked that she would do that without talking to him first. Amy explains that the money is really their money anyway, and then says, \"This is the part where you say, 'It's all background noise.'\" He appears to calm down, and repeats the phrase. Later on, Nick has started losing interest in the marriage and has begun overspending on electronics like video games and a new laptop. Amy thinks he is trying to make her look like a cold, bitchy wife. To make matters worse, Nick and Margo's mother Maureen (Cyd Strittmatter) has been diagnosed with breast cancer, forcing Nick and Amy to move back to his hometown in Missouri. Amy feels a bit upset because Nick didn't even discuss the decision to move to Missouri with her, although she does support it. In general, Amy feels left out. She says he is just using her for sex. Nick is getting ready to go out with his old friends one evening when Amy tries to persuade him to stay with her, but he refuses. Then she offers to join him, but he also refuses, saying how she won't enjoy it. Then Any makes the suggestion that they have a child. He starts to get angry, asking why couldn't they have had this argument four hours prior, instead of when he is about to leave. The argument escalates as they go down the stairs, and at the bottom of the stairs Nick grabs Amy and throws her down, and she strikes the bannister post and falls to the floor. He immediately looks shameful.Present DayA few nights after Amy disappears, Nick is at Margo's house. It's late and Margo has gone to bed. Nick gets a text saying, \"I'm outside.\" Nick opens the back door. A young woman, Andie Fitzgerald (Emily Ratajkowski), comes in and starts kissing Nick. He tells her to be quiet while Margo is sleeping. He makes sure that Andie hasn't said anything to anybody about her affair with Nick or that he has mentioned wanting to divorce Amy. He asks her if she left some red panties in his office, and she is doubtful, but not 100% sure. They continue kissing and have sex.Nick has Andie slip out the door early in the morning, thinking Margo is still asleep. However, Margo appears in the kitchen and angrily berates her brother for lying to her, knowing what would happen if the cops or media were to find out about this.At night, there is a vigil for Amy. Nick stands alongside her parents, and tries to seem more empathetic and anxious to find Amy, telling the crowd how he truly loves his wife. Andie is clearly visible up front in the crowd and mouths the word \"asshole\" in a way that only he can see. Noelle walks by and calls out to Nick, asking him if he knew that Amy was six weeks pregnant. The reporters chase Nick all the way to the police car as they escort him away.Margo presses Nick about the pregnancy bombshell. He says he did not know she was pregnant, but that he did want kids and Amy didn't. He shows her a letter from a fertility clinic that they were going to, stating that they were going to dispose of a semen sample they had left there, unless someone came to retrieve it.Rhonda and Jim meet Nick back in his home and explain that the results of a light test showed that someone wiped up a large pool of blood in the kitchen. Nick also doubts that Amy knew Noelle, until Rhonda shows him photographs of the two of them together, along with Noelle's kids. She even hands Nick a document of recent expensive transactions from his credit card, mentioning items including golf clubs and a Stratocaster guitar, though Nick says he never bought any of those items. Additionally, Rhonda presses Nick about the fact that he upped Amy's life insurance policy earlier that year to over a million dollars. He barks back, \"because she told me to!\" Rhonda gets a call confirming Amy's urine sample analysis indicate that she was indeed pregnant.Nick remembers the third clue in his pocket, and tries to decipher it. Rhonda and Jim continue their investigation, checking out the abandoned mall, now frequented by prostitutes and drug dealers. They find a local dealer and show him a picture of Amy. He tells Rhonda that she came by and tried to buy a gun from him. He had a clear memory of the event; it was Valentine's Day and she had been wearing a pink dress. They go back to Nick's father's home, wondering why Nick went there in the first place so soon after Amy's disappearance. In the furnace in the basement, they find Amy's diary hidden in the furnace, burnt slightly. Nick, meanwhile, figures out that the third clue refers to a wood shed outside Margo's home. He discovers a large pile of items from the credit card purchases stored there, as well as a gift-wrapped box in the middle of it all.Amy's Version: July 5, 2012We go back to \"the morning of\", and we learn the truth: Amy is alive, and she staged everything to lead up to her disappearance. She is seen driving away from Missouri with her arm bandaged up with a blood spot evident on the inside of her elbow. Amy had used a variety of pens to make recent diary entries appear as if they were written over the past five years, and periodically threw each one out the car window. It documents a happy marriage deteriorating to the point where she buys a gun because she is afraid that Nick may kill her. She even faked her pregnancy by befriending pregnant Noelle and making her think that Nick was hurting her. Amy drained her toilet and offered Noelle lemonade until she had to use the bathroom. Amy then stole her urine and used it to submit it for the pregnancy test.On their fifth anniversary, Amy told Nick to take a walk and really think about their marriage, knowing full well he would go for a walk in his favorite isolated spot along the beach and thus have no alibi. Meanwhile she set up a crime scene to make Nick look guilty. Her plans included suicide so that her body would be found to completely frame Nick. To make sure she's not found out, she cuts her hair, dyes it, and makes herself look unkempt and disheveled. She begins eating large amounts of junk food to gain weight. She hides out at a small resort under the name Nancy, even hitting herself in the face with a hammer to sell the idea that she is hiding from an abusive boyfriend. She befriends a woman named Greta (Lola Kirke). Amy tells her how she came across Nick leaving the bar with Andie during a snowy night, wiping her lips before he kissed her the same way he kissed Amy when they first met (this part is true). With her plan working perfectly, she postpones her suicide for another month.Back to Nick:Nick brings the gift box inside and opens it to find Punch and Judy dolls, with the Judy doll holding a baby and missing a mallet. Together, he and Margo deduce that Amy has framed Nick for her disappearance.Nick goes to New York City to find Tanner Bolt (Tyler Perry), a lawyer specializing in tough, high-profile cases who has been following Nick's story in the media. He agrees to help Nick in his defense. He gives Nick the contact information of Tommy O'Hara (Amy's second boyfriend, who was charged with sexual assault) so that Nick can ask him questions.Nick meets Tommy (Scoot McNairy) in a bar. Tommy says he and Amy dated for a while, but he could see that she was using him. He gave her some space, hoping she'd break off the relationship. One day, she seduced him, and told him she wanted rough sex. She staged a scene where she had marked her wrists and left neckties tied to the bed to make it appear he had tied her up. She went to the police, and claimed he had raped her. He pleaded guilty to a reduced charge to avoid prison time. Now he is a registered sex offender and has not been able to get a job. He warns Nick about how evil and manipulative she is. Nick later visits Desi after finding his address from a letter he wrote to Amy. After Nick asks Desi about his side of the story regarding his attempted suicide, Desi closes the door on him and walks back inside his house without confirming or denying the things she told Nick about him.At the resort, Amy plays mini-golf with Greta and her friend Jeff (Boyd Holbrook). At one point, she jumps up and drops her fanny pack full of money. Greta and Jeff notice. The next day, as Amy is cleaning the room meticulous to prepare to leave, they force their way into her room and start searching for the money. Amy threatens to call the police. Greta says that she doesn't know what she's up to, but has dyed hair and she doesn't think she's ever been hit. Greta says, \"You won't call the police.\" They find the money under her dress, and take it. Now penniless and desperate, Amy calls the Missing Amy tip line, and reports suspicious activity at Margo's wood shed. She then places a call from a pay phone.Meanwhile, Tanner goes to Missouri to help Nick and Margo clear up Nick's image. Nick tells Tanner what he thinks has been going on with Amy, dropping clues that only he would really know. For instance, the reason he knew that the \"brown house\" in the treasure hunt clue was his dad's house was because they used to pretend that his dad was a spy called Mr. Brown. Nick also admits to the affair, which Tanner says he ought to tell the cops about so that it gives them one less reason to think Nick had a motivation to kill Amy.Nick later books an interview on TV with Sharon Schieber (Sela Ward) to tell his side of the story. Tanner coaches him to make him seem more likeable by having Nick admit that he's been unfaithful and dishonest, which would earn him some possible points in the media.On the day of the interview, Tanner keeps trying to get Nick to come off less smug and more genuinely upset by pelting him with gummy bears in his dressing room when Nick appears too smug or untrustworthy.At the same time, Desi meets Amy at a casino. She never mentions getting her money stolen, but she continues to play up the abused wife angle. They leave for Desi's lake house.As Nick meets Sharon, a bombshell hits the news: Andie has confessed to her affair with Nick at a press conference, with Amy's parents. Desi and Amy see the news while Sharon gets wind of it at the same time. Marybeth tells reporters that her and Rand's love for Nick has ended then and there.Desi and Amy watch Nick's interview with Sharon, while Nick is watching with Margo. Nick convincingly comes off as remorseful for the affair, but he insists that he did not kill his wife. Sharon lets him speak directly into the camera to say something to Amy. He says he loves her and mentions the woodshed (figuratively, apparently as a secret message to Amy) before putting two fingers on his chin, knowing Amy would recognize that. Margo checks the Internet and sees that Nick is trending positive with the public.Things take an unfortunate turn when Rhonda and other officers show up at Margo's home with a search warrant due to the call about the woodshed. They find all the merchandise from the credit card bill. Both Nick and Margo are taken into custody. Rhonda reads to Nick the pages of Amy's diary, which ends with \"This man may truly kill me.\" Jim brings in the missing Judy mallet from the puppets. It has been burned in their fireplace, but traces of Amy's blood are found on it. Rhonda now has a murder weapon, and arrests Nick. He protests, but Tanner shuts him up.At Desi's home, Amy learns that Desi has security cameras installed all over the property. She is virtually a prisoner in his home. While he's out at work, she clearly stages what looks like a brutal rape. She soaks her nightgown in red wine, binds her hands and feet, then crawls to the camera, crying, making it look like she's just been raped.Nick and Margo are released on bond. The media continues to hound them on the way out, now that everyone is convinced Nick is a cold monster. Nick quietly whispers to himself, \"Come home, Amy. I dare you.\"Amy waits for Desi to come home. She gets a wine bottle and puts it in herself to create injuries. When Desi gets home, Amy seduces him and agrees to run off with him to Greece once the trial is over. They go into the bedroom. She starts taking his clothes off, tearing his shirt open, and they start having sex. Amy demands it to be harder. Desi is caught off guard, once he gives over to the moment, lifting his head to the ceiling, Amy grabs a box cutter she concealed beneath the pillows and slashes his throat. She is drenched in his blood as he dies underneath her. She does look upset about what she's just done.Nearly a month after Amy's disappearance, Nick looks out his window and sees Amy drive up, still covered in blood. The reporters and neighbors are shocked and begin clamoring around Nick and Amy as she walks up to him. He whispers to her, \"You fucking bitch\", before she collapses in his arms.At the hospital, Amy is interviewed by a roomful of police and weaves a fabricated story about how Desi kidnapped and raped her before she made her heroic escape. Rhonda asks her questions about the items in Margo's woodshed, but Amy deflects the question and returns to her rape story, while also being heavily medicated on painkillers. The reporters follow her and Nick home, happy that she's alive and that Nick is now vindicated. However, Nick knows something is wrong, and asks her what really happened. Amy forces Nick to disrobe to prove he's not wearing a wire. She goes to the shower to wash off the copious amounts of Desi's blood still covering her. In the shower with Nick, she all but confesses that she framed Desi and murdered him in order to return to Nick as he had requested (and presumably also to make her return seem heroic). Nick sleeps in a separate room and locks the door behind him.Nick meets with Tanner, Margo, and Rhonda (who now trusts Nick) about this revelation, though without sufficient evidence and with everyone on Amy's side, they cannot prove that she murdered Desi.Seven weeks later.Nick and Amy make their first public appearance together at the volunteer center, posing as a happily reunited couple. They are even set to have an interview with Ellen Abbott in their home. As they are getting ready, Amy gives Nick a gift, which is a pregnancy test. It's positive. Nick first says it can't be his, and he'll demand a blood test. Then he realizes that she has retrieved his semen sample, and is using this as a ploy to keep him with her by impregnating herself. The tension escalates and he grabs her and slams her head against the wall, calling her a cunt. She tells him she's the same cunt he fell in love with. And she's the only cunt that ever made him feel like a man. Reluctantly, Nick joins Amy hand-in-hand for the interview. During the interview, Amy prods Nick and he says they're going to be parents, when Ellen appears overjoyed and hugs Amy. Margo later finds out about the pregnancy and cries for her brother, and is distraught that he plans to stay with her for the sake of the child... at least for the next 18 years.The film concludes with a similar shot as the opening, Nick stroking Amy's hair again, wondering to himself just what she's thinking.", "language": ["English"], "release_date": "31 October 2014", "viewer_count": "701438"}, {"movie_name": "Black Panther", "movie_year": "2018", "actors": ["Chadwick Boseman", "Michael B. Jordan", "Lupita Nyong'o"], "director": "Ryan Coogler", "writers": ["Ryan Coogler", "Joe Robert Cole"], "genres": ["Action", "Adventure", "Sci-Fi"], "review_rating": "7.6", "keywords": ["africa", "marvel cinematic universe", "superhero", "based on comic book", "black panther character"], "user_review_count": "1871", "critic_review_count": "540", "synopsis": "Centuries ago, as five African tribes war over a meteorite made up of the alien metal vibranium, a warrior ingests a \"heart-shaped herb\" affected by the metal and gains superhuman abilities. Becoming the first \"Black Panther\", he unites four of the five tribes and forms the nation of Wakanda. As time passes, the Wakandans use the vibranium to develop highly-advanced technology while simultaneously isolating themselves from the rest of the world and posing as a third world country.While working undercover in Oakland, California in the late 20th century, Prince N'Jobu becomes convinced that Wakanda's isolationist policies have done more harm than good and vows to share its technology with people of African descent around the world in order to help them conquer their oppressors. N'Jobu enlists black-market arms dealer Ulysses Klaue to infiltrate Wakanda and remove a cache of vibranium.In 1992, King T'Chaka learns of his brother's actions. He confronts N'Jobu, who becomes angry and threatens to kill T'Chaka's loyal friend, Zuri. T'Chaka reluctantly kills N'Jobu to save Zuri, and abandons N'Jobu's son Erik in order to prevent the Wakandan people from learning the truth.In the present day, following T'Chaka's death at the hands of Helmut Zemo, disguised as a masked James Barnes, his son T'Challa returns to Wakanda to assume the throne. After working with Okoye, the leader of the all-female fighting force the Dora Milaje, to extract his ex-lover Nakia from an undercover assignment in Nigeria's Sambisa Forest, he reunites with his mother Queen Ramonda and younger sister Princess Shuri, the nation's current technological genius. At his kingship ceremony he is challenged for the crown by M'Baku, the leader of the fifth tribe, the mountain-dwelling Jabari. The two engage in ritual combat, with T'Challa emerging victorious and becoming the new King. He let's M'Baku live.In London, a gang led by Klaue and including an ex-U.S. black ops soldier, Erik Stevens a/k/a/ \"Killmonger,\" steals an ancient Wakandan vibranium axe from a museum. When the tribal elders receive word that Klaue has resurfaced in South Korea, T'Challa's friend W'Kabi, who lost his parents as a result of the dealer's actions, urges the young monarch to bring him to justice. T'Challa, Okoye, and Nakia plan to intercept Klaue at an underground casino in Busan, where he will be selling the axe to an unknown buyer. The plan, however, goes wrong when T'Challa discovers the buyer is CIA agent Everett Ross and Klaue suspects the deal is a setup.The deal subsequently goes sour, and a car chase ensues that culminates in Klaue's apprehension. While in CIA custody, however, Klaue is rescued by Killminger. Ross is seriously injured saving Nakia in the attack, and rather than pursue Klaue, T'Challa takes Ross to Wakanda where his sister Shuri uses the nation's advanced technology to save Ross' life.Killmonger kills Klaue and takes his body to Wakanda as a token, revealing his identity as N'Jobu's son to the tribal elders and challenging T'Challa for the throne. Killmonger triumphs in ritual combat and hurls the defeated T'Challa over a waterfall. After ingesting the heart-shaped herb to gain the powers of the Black Panther, Killmonger enacts his father's plan, preparing shipments of Wakandan weapons to be distributed to Wakandan operatives around the world. Nakia, Shuri, Ross, and T'Challa's mother Ramonda flee to seek the aid of the Jabari and learn M'Baku's men have found and are caring for the comatose T'Challa.Healed by a heart-shaped herb brought by Nakia, T'Challa returns to Wakanda and to renew his combat with Killmonger for the throne, which was never officially concluded since T'Challa never died or conceded. When Killmonger refuses to cooperate, his claim to the throne is immediately invalidated and Okoye and the Dora Milaje turn against him. However, Killmonger who is now wearing a suit of Black Panther armor of his own resists with force along with the Border Tribe. While Shuri, Nakia, and Jabari battle W'Kabi, Ross, piloting a remote jet with Shuri's guidance, shoots down the planes carrying the weapons before they can leave the country. The battle goes poorly for T'Challa's side until M'Baku and the Jabari arrive to support him, thus turning the tide. T'Challa and Killmonger's battle carries them into the heart of the vibranium mine, where sonic disruptors used in the transport of the metal incapacitate their vibranium armor. While Killmonger's body is briefly exposed, T'Challa stabs his cousin. He takes Killmonger to see the sunset of Wakanda and offers to heal him. But Killmonger states that he knows he will then be imprisoned and would rather die a free man. He pulls the dagger out of his chest and dies.With that victory, T'Challa is officially restored to the throne, with M'Baku granted a seat in the national tribal council to represent his tribe in recognition of his loyalty. Rejecting the isolationism of past Wakandan kings, T'Challa establishes an embassy in the United States to be run by Nakia and Shuri. In a mid-credits scene, T'Challa appears before the United Nations to reveal Wakanda's true nature to the world. In a post-credits scene, Shuri continues to help Bucky Barnes with his recuperation.", "language": ["Swahili", "Nama", "English", "Xhosa", "Korean"], "release_date": "16 February 2018", "viewer_count": "286824"}, {"movie_name": "A Quiet Place", "movie_year": "2018", "actors": ["Emily Blunt", "John Krasinski", "Millicent Simmonds"], "director": "John Krasinski", "writers": ["Bryan Woods", "Scott Beck"], "genres": ["Drama", "Horror", "Sci-Fi", "Thriller"], "review_rating": "8.0", "keywords": ["survival", "pregnancy", "child in peril", "deafness", "bathtub"], "user_review_count": "1090", "critic_review_count": "373", "synopsis": "Day 89Amid the many, tattered missing persons fliers; a family quietly tiptoes barefoot through an empty store of a ghost town. The family's mother, Evelyn Abbott (Emily Blunt), carefully looks through a cluster of uncollected prescription bottles for her eldest son, Marcus (Noah Jupe), who is sick. Evelyn gives Marcus some medication and uses sign language to reassure her hearing-impaired daughter, Regan (Millicent Simmonds), that her brother is okay. Regan then checks on her younger brother, Beau (Cade Woodward), who is drawing a picture of a rocket on the floor. He signs to Regan, \"Rocket. That's how we'll get away.\", then climbs the mostly empty shelves and reaches for a space shuttle toy. The toy falls from the shelf, but Regan scrambles to catch it before it hits the floor. Meanwhile, the family's father, Lee Abbott (John Krasinski), has scavenged some electronics for a radio which will boost its signal as well as some cutting pliers for Regan. Evelyn signs to her family that \"It'll be dark soon\" and they prepare to leave when looks of horror come across their faces. Beau has the electronic space shuttle toy in his hands which Lee carefully takes from him removing its 2 AA batteries. He signs to his youngest son, \"It's too loud.\" As the family departs, Regan sneaks the toy back to Beau who then grabs the batteries on his way out. The Abbotts silently walk back home on a trail of sand they've created. As they come to a walking bridge, they suddenly hear the electronic sound of the space shuttle toy from Beau who is pulling up the rear. A horrified Lee races back toward his son, but it's too late, an alien creature quickly seizes and kills Beau.Day 389The Abbotts are home on their family farm. Lee is in the basement of the farm house where he has set up an extensive surveillance system of cameras and monitors as well as his radio and electronics which he uses in the hope of contacting any other survivors. There are also scores of various news clippings which report of an alien invasion, as well as notes from Lee that read, \"blind\", \"attack sound\", and \"armour\". Evelyn, meanwhile, is in a cellar where she hangs a mobile she has crafted. Evelyn is pregnant. She sets up an oxygen tank which is connected to an infant breathing mask. It sits next to a covered, sound-proof baby crib. Lee has moved up to the top of his grain silo where he looks through pictures of Beau.Evelyn asks Regan to tell her father that dinner is ready, which she reluctantly does. After silent prayer, they eat quiet foods on leaves of lettuce instead of plates. Afterwards, Regan and Marcus play Monopoly when he accidentally knocks over a lantern which sets the rug on fire. Lee quickly puts it out, and they quietly wait for the consequences. It seems as though they've dodged a bullet but then hear a loud noise on the roof. Lee looks out the window and is startled, but relieved, to see a raccoon fall from the roof. He heads down into the basement to work on a cochlear implant which will help his daughter hear. Evelyn comes down where they share a smile and a set of ear buds as they slow dance to Neil Young's Harvest Moon.Day 473While Lee is pouring down more sand on their walking paths, Evelyn is in the cellar checking her blood pressure. Her due date is just a couple weeks away. She places a stethoscope to her abdomen revealing a strong, healthy heartbeat. Regan enters the house being careful to walk only on the marked parts of the floor which don't creek and wants to go down into the basement, but her dad stops her. He has added small amplifiers from a stereo to her new cochlear implants and wants to put them on Regan, but she stops him and signs that they never work. Lee, disheartened, hands them to her instead and starts to set out on an excursion. He wants Marcus to come with him, but the boy is scared and doesn't want to go. Instead, it's Regan who wants to go, but Lee tells her to stay and take care of her mom. She runs to her room and tries on the new cochlear implant. When they don't work, she's devastated. Regan packs a bag which includes her cutting pliers and a wrapped object from her dresser, then leaves the farm.Lee has taken his son to the river where he teaches him that making small sounds is okay as long as louder sounds are nearby. Next to a waterfall they can speak freely to each other w/out fear of being heard. Marcus asks his dad why he didn't let Regan come and if he blames her for what happened to Beau, because she blames herself. When Lee says it was no one's fault, Marcus tells him if he still loves her, he should tell her. During this conversation, Regan has arrived at the walking bridge where a makeshift memorial has been constructed for Beau. She unwraps the object from her dresser which we discover is the space shuttle toy, then uses the pliers to cut a wire which enables the toy to light up w/out making any noise. Back at home, Evelyn is carrying a laundry bag up from the basement when it gets snagged on the stairs. She manages to pull it loose causing her to fall and exposing the point of a nail sticking up from the stair.On the way back home, Lee and Marcus are startled by an old man coming out of the woods, and then notice the dead body of his wife on the ground nearby. Lee implores the old man to stay silent, but instead he lets out a primal scream. Lee grabs Marcus and runs as the man is quickly scooped up and killed by an alien. Back home, Evelyn's water breaks. She heads down to the basement and impales her foot on the exposed nail coming up from the stair. She manages not to scream out, but drops the picture frames she was holding which draws an alien into the house. Evelyn pulls her foot off the nail, switches on the red light-bulbs which run across the property and serve as a warning signal, and searches the shelves for a mechanical kitchen timer. The alien slowly walks down the stairs into the basement listening for any evidence of life. When the timer goes off, the alien attacks it as Evelyn runs upstairs. She sees another alien in the front yard. Evelyn goes upstairs into the bathroom and sinks into the tub. She's starting to give birth as the alien comes upstairs.Lee has returned home and is horrified to see that the red lights have been switched on. He signs the word \"rocket\" to his son. Then tells him, \"I need you to make a sound louder. You can do it.\" Lee grabs his shotgun as Marcus sprints to a designated area and lights a fuse which sets off a series of fireworks. Lee searches the house and walks into the bathroom where he sees an empty bathtub covered in his wife's blood. He starts to weep believing Evelyn is dead, then discovers that she is safe and hiding in the shower w/ their new baby boy. Marcus, meanwhile, is walking back toward the house when he hears an alien. He makes a run for it into the cornfield, but runs straight into a tractor wheel, knocking himself unconscious.Regan has returned home and notices the beam of Marcus' flashlight coming out from the cornfield, but cannot hear the alien coming up behind her. But as the alien moves closer, Regan's implant starts producing a high-pitched feedback which distresses the alien causing it to run off. Regan finds Marcus and they retreat to the top of the grain silo. Lee has taken Evelyn to the cellar and placed his new son into the sound-proof crib. Evelyn thinks about Beau and regrets that she didn't carry him on that fateful day, then, before getting some much needed sleep, makes Lee promise that he will protect their children. Lee leaves to look for the kids as we see water rushing down into the cellar. Later, Evelyn wakes to find that the cellar has flooded. On top of this, an alien has climbed down inside the room, and the baby is sleeping in the sound-proof crib but the top is open. Evelyn carefully picks up her baby and slinks to the back of the cellar behind the waterfall flooding the room.On top of the silo, Marcus signs, \"Don't worry, he'll come for us.\" but Regan shakes her head replying, \"He'll come for you.\" All of a sudden a hatch on the top of the silo breaks causing Marcus to fall inside of it. As he's slowly drowning in the grain, the alien in the cellar w/ Evelyn is drawn out by the noise. The hatch breaks away completely and falls into the silo just missing Marcus. Regan, herself, jumps into the silo and successful saves her brother by pushing the hatch towards him so he can grab hold of it. However, she herself quickly sinks into the grain. Marcus climbs onto the hatch and pulls out his sister to safety. Regan and Marcus both sit safely atop the silo door, but then they hear a crash on top of the silo. The alien from the flooded cellar jumps in the silo as the kids cover themselves with the hatch door. They seem doomed until Regan's hearing aid once again lets out a piercing feedback forcing the alien to crash out the side of the silo.Regan and Marcus crawl out of the silo and into a pickup truck. Lee has arrived on the scene and grabs an ax, but is quickly attacked by the alien which causes Marcus to scream. Upon hearing this, the alien heads for the truck and starts ripping it open. This time when Regan's cochlear implant starts its piercing feedback, she turns it off. Now the alien can safely resume its attack on the truck. Lee, who is badly injured, makes eye contact with his daughter and signs, \"I love you. I have always loved you.\" He then lets out a yell to sacrifice himself and save the kids. They put the truck into neutral and roll it back to the house where they reunite with their mother.Evelyn and the kids hear the alien approaching, so they retreat back into the house and head down to the basement. Regan, who was never allowed down there, sees (for the first time) the evidence of all the work her father put into repairing and creating her hearing aids. She is overwhelmed with emotion just as the lights begin to flicker. The alien walks down into the basement and has them cornered. Regan, however, scans a handwritten scribbling from her dad which read, \"What is their weakness?\", then takes a quick glance at the cochlear implants on his workbench. And Eureka! She switches on her hearing aid, creating feedback, and causing the alien to shudder. Regan then amplifies the feedback by holding the hearing aid up against a microphone. The alien collapses then slowly staggers back up on its feet, but Evelyn has grabbed Lee's shotgun and blows its head to pieces. When they see on the surveillance monitors that this little brouhaha has seemingly brought every alien in the county to their home, Regan turns up the speakers while Evelyn pumps the shotgun wearing a wry grin on her face.", "language": ["English", "American Sign Language"], "release_date": "6 April 2018", "viewer_count": "94650"}, {"movie_name": "The Greatest Showman", "movie_year": "2017", "actors": ["Hugh Jackman", "Michelle Williams", "Zac Efron"], "director": "Michael Gracey", "writers": ["Jenny Bicks", "Bill Condon"], "genres": ["Biography", "Drama", "Musical"], "review_rating": "7.8", "keywords": ["social outcast", "social prejudice", "circus act", "singing", "showman"], "user_review_count": "1032", "critic_review_count": "295", "synopsis": "The film opens with Phineas Taylor \"P.T.\" Barnum (Hugh Jackman) joining his circus troupe in a song (\"The Greatest Show\"), playing to an enthusiastic crowd as he and his performers put on a dazzling show.We cut to Barnum as a young boy (Ellis Rubin) in the 1800's, working with his tailor father Philo (Will Swenson). They arrive at the home of Mr. Hallett (Fred Lehne) and his daughter Charity (Skylar Dunn). P.T. makes Charity laugh and spit out her tea, prompting her father to smack him across the face and forbid him from going near her. Regardless, P.T. and Charity spend time together and develop a close friendship in song (\"A Million Dreams\"), even as Charity is forced to go to a finishing school. They write letters to each other and eventually reunite as adults, where Barnum proposes to Charity (now played by Michelle Williams).Barnum works for a trading company until his boss tells everyone that they are shutting the company down due to bankruptcy after their trading vessels have sunk to the bottom of the ocean. Barnum goes home to Charity and their daughters Caroline (Austyn Johnson) and Helen (Cameron Seely). He brings home a spinning lamp, or \"wishing machine\", for Caroline's birthday. Charity and the girls all make wishes, and Barnum hatches an idea.Barnum goes to the bank for a $10,000 loan and uses the deed to the (sunken) trading vessels as collateral. With the money, he opens up a museum devoted to oddities, because he thinks people are fascinated with things like that. The museum fails to attract business, and most people reject the idea.Barnum then goes around town searching for unique individuals. Among them are a dwarf named Charles Stratton (Sam Humphrey), a bearded woman named Lettie Lutz (Keala Settle), an obese man called Lord of Leeds (Daniel Everidge), a hair-covered man referred to as Dog Boy (Luciano Acuna, Jr.), and an 8-foot tall man. Although initially viewed as freaks, Barnum manages to get them all to put on a musical number of shows that win over crowds every night (\"Come Alive\"). One who remains unimpressed is critic James Gordon Bennett (Paul Sparks). Despite his lack of interest in Barnum's show, Bennett inspires him to rename his show as \"P.T. Barnum's Circus\".The circus starts to bring in healthy profits, leading Barnum to move his family into a luxurious mansion, as well as being able to put Caroline in a ballet school. However, she becomes discouraged when the other girls mock her for being part of a circus family.Barnum later meets a playwright named Phillip Carlyle (Zac Efron). He approaches Philip with the opportunity to join his circus (\"The Other Side\"), and Phillip agrees on the condition that he get 10% of the profits.The troupe is invited to England to meet Queen Victoria (Gayle Rankin). She notes that Charles (now going as General Tom Thumb) is exceptionally short, and he makes a crack that she's not so tall either. After an awkward silence, Victoria lets out a hearty laugh. Later, Barnum and Phillip meet noted opera singer Jenny Lind (Rebecca Ferguson), and they invite her to perform for the show so that she may become known worldwide.Jenny joins the show back in the States. She performs before a large crowd (\"Never Enough\") that includes Phillip's parents, as well as Charity's. The crowd loves her, and Barnum even spots Bennett in the audience appearing to enjoy her. He finds himself falling for the show's trapeze artist Anne Wheeler (Zendaya). After Jenny's performance, Barnum and the others gather with a party, but when the rest of the troupe wants to join the party, Barnum turns them away. Although sad at first, the troupe decides not to let this get them down, as they decide to embrace who they are, regardless of how they are viewed (\"This is Me\").Phillip tries to introduce Anne to his parents, but they disapprove of her because of her race. She leaves upset, and Phillip tells his parents off for how they spoke to Anne. He goes to find her, and they express their mutual feelings for one another (\"Rewrite The Stars\").Barnum goes on tour with Jenny, leaving Phillip as the ringmaster with the show. Protesters continuously gather outside to harass the troupe for their physical differences. The distance proves to be hard for Charity and the girls (\"Tightrope\"). While celebrating their success so far, Jenny appears to develop an attraction to Barnum, but he remains faithful to Charity. Jenny gets upset and threatens to quit, but Barnum has her finish the tour. After one performance, the press snaps a photo of Jenny kissing Barnum before she ultimately quits.Phillip confronts the protesters, but they refuse to leave. When they threaten him and the others, Anne's brother W.D. (Yahya Abdul-Mateen III) throws the first punch, leading to an all-out brawl between the troupe and the protesters. One of the protesters grabs a lantern and throws it at a wall, setting the theater ablaze. Barnum returns home from his tour and greets his family when he overhears about the fire. He runs toward it just as the flames consume the whole building. Phillip runs inside to find Anne, but she is already coming out with W.D. Barnum runs in for Phillip, just as the building collapses. His daughters cry, thinking him dead, until he emerges with an unconscious Phillip. He is taken to the hospital.Barnum just sits outside the remains of the theater. Bennett goes to join him, saying that the police arrested the thugs that started the fire, and while Bennett didn't enjoy Barnum's show, he feels that another critic may have called it a \"celebration of humanity\". He then shows Barnum the newspaper, which shows Jenny kissing him and her announcement of quitting. Barnum rushes home to Charity, only to find that she's packed her bags because the bank is evicting them, but she is also unhappy over seeing the paper, despite Barnum trying to explain himself.Barnum goes to drink at a bar. The entire troupe finds him and confronts him. Lettie tells Barnum that while he may not have always done the right thing, he saw them all as more than freaks and gave them a real family and home. Barnum is encouraged to pick himself up and help get the troupe back to performing (\"From Now On\"). He then runs to Charity's childhood home where the girls tell him that she's at the beach. Barnum goes to apologize to her for being obsessed with chasing fame, and she says all she wanted was the man she fell in love with.Phillip, who has recovered, offers to provide his shares from profits to restart the circus. Although Barnum hesitates, Phillip is adamant in being his partner with 50% of shares. Barnum restarts the show in a tent with circus animals and the rest of the troupe. Audiences turn out in droves. Barnum then decides to hand over the job of ringmaster to Phillip so that he can go and watch his girls grow up. Phillip finishes the show and kisses Anne, while Barnum rides an elephant to meet Charity and the girls.The film ends with Barnum and Charity watching Caroline perform in the ballet (with Helen playing a tree), and Barnum acknowledging that everything he ever wanted and needed is right in front of him.", "language": ["English"], "release_date": "29 December 2017", "viewer_count": "119778"}, {"movie_name": "Game Night", "movie_year": "2018", "actors": ["Jason Bateman", "Rachel McAdams", "Kyle Chandler"], "director": "John Francis Daley,", "writers": ["Mark Perez"], "genres": ["Comedy", "Crime", "Mystery", "Thriller"], "review_rating": "7.2", "keywords": ["black comedy", "game night", "husband wife relationship", "kidnapping", "trying to conceive"], "user_review_count": "232", "critic_review_count": "229", "synopsis": "The film starts with a trivia night competition at a bar. Two teams are competing, and the most competitive members from each team, Max (Jason Bateman) and Annie (Rachel McAdams), meet when they answer the same question correctly. The two start dating as they start beating their friends during their game nights until Max proposes to Annie during a game of Charades, and the two later get married and play each other at a dancing game.In the present day, Max and Annie are trying to have kids, but when they visit Dr. Chin (Camille Chen), they learn that they are having trouble conceiving, which is attributed to Max feeling stressed out lately. Annie figures that Max is stressing over his older, more successful brother Brooks (Kyle Chandler) visiting that night, as he has always been upstaging Max throughout their lives.Max and Annie return home to prepare for their game night later that evening. They run into their creepy neighbor Gary (Jesse Plemons), who used to attend game nights with his wife Debbie (Jessica Clair Lee) until their divorce. Everyone finds him really weird and annoying, so his only company is his dog Bastian. Gary notices they are setting up for a game night, but the couple denies it so they won't have to invite him.The couple's friends arrive later that night. There's childhood sweethearts Kevin (Lamorne Morris) and Michelle (Kylie Bunbury), and dim-witted Ryan (Billy Magnussen), who brings a pretty but equally dim date, and the others point out that he always loses because he brings dumb girls with him. The friends sneak in by climbing in through the windows since Max and Annie told them to do so since they don't want Gary to know they really are having a game night. Unfortunately, this is ruined when Brooks pulls up in a Stingray (Max's dream car) and makes it painfully obvious to Gary that Max and Annie lied to him. When Brooks does join the game, he hijacks it by telling the party about an embarrassing story from Max's childhood when he supposedly tried to blow himself. This throws Max off his game and he and Annie lose. Brooks then invites everyone to go to his house the next week for game night. Annie becomes upset because she feels Brooks is deliberately screwing with Max and ruining their chances of conceiving. She supports Max in taking Brooks down the following week.During the next game night, everyone shows up at Brooks's really nice house. Ryan brings a new woman, Sarah (Sharon Horgan), whom he brought because she is significantly smarter than all the other girls he's brought with him. Brooks starts the party off by having everyone do a drinking game of \"Never Have I Ever\". When the matter of sleeping with a celebrity is mentioned, Michelle takes a drink, which makes Kevin feel insecure as he didn't know about this in the whole time they were together.Moments later, a man, \"Agent Henderson\" (Jeffrey Wright), enters the house with FBI dossiers that will serve as clues that will lead them to go on a hunt for kidnappers, and the winners get Brooks's Stingray, which gives Max more of an incentive to win. However, two real kidnappers break in, knock out Henderson, and start attacking Brooks. Brooks fights the two men all around the house while everyone thinks it's part of the game. Brooks is eventually taken, and the gang looks over the dossiers to read the clues. Max and Annie leave when they figure their clue out, while Sarah manages to get in touch with the people who made the game so that she and Ryan can get a step up, and Kevin and Michelle are trapped in Brooks's office when Ryan leaves them in there as they have found a clue. Kevin tries to climb through the ceiling over a stack of boxes, causing him to topple over and knock the door open.Max and Annie are led to a bar, with Annie having taken a real gun that fell out of Brooks's pocket during the struggle, but she thinks it's a prop. In the bar, they see Brooks in the back room and hold the men in the bar at gunpoint while they try to get to Brooks. When they find him, Brooks says none of this is part of the game and that he is in real trouble with real bad guys. Annie then fools around with the gun until she fires it off and sees it's real. She accidentally shoots Max in the arm, causing him to bleed severely. The bad guys start to break in, so Max and Annie grab Brooks and run out. As they drive away, Brooks admits that his success never came from working on Wall Street like he's always claimed, but rather because he's been smuggling stuff, and he stole a Faberge egg from a criminal called The Bulgarian and sold it to someone named Marlon Freeman. The villains then find Max and Annie's car and go after them. Brooks jumps out of the car so that Max and Annie can get away, leading him to get taken again.Ryan and Sarah go to the publishing company and meet Glenda (Chelsea Peretti), who just came from a murder mystery party where she was the corpse, so she startles the two. They have to bribe her into giving up the next clue. Meanwhile, the actual actors playing kidnappers show up at Brooks's house, leading Kevin and Michelle to realize that everything that happened earlier was real. They get in touch with Ryan and Sarah after learning the truth.Max and Annie stop to buy supplies so that Annie can take care of Max's gunshot wound. It leads to her cutting into his bone, the two of them gagging uncontrollably, and then ultimately realizing that the bullet exited Max's arm earlier.The group all go to Gary's house since he's a cop and would have a computer that has information on the aliases Brooks told Max. They are forced to play Jenga with Gary while Max goes to his office to use the computer. The office is full of memorabilia of Gary and Debbie when they were married. Max learns that Marlon Freeman is really a rich guy named Donald Anderton (Danny Huston), while The Bulgarian has evaded capture. Bastian then wanders into the room as Max's arm drips blood onto the carpet, and then onto the dog. Max tries to clean it off but only makes things worse. He then rounds everyone up to leave.The kidnappers call Max and warn him that they'll kill Brooks within less than an hour if they don't deliver the egg. The group arrives at Anderton's home to find the egg. Anderton is holding a fight club in the basement, which Ryan and Sarah watch while the others go look for the egg. During their search, after much badgering over the matter, Michelle finally admits to Kevin that the celebrity she apparently slept with was Denzel Washington. She recounts the story and even has a picture, until Kevin has to tell her that it wasn't Denzel, but a guy who looks a lot like him. Meanwhile, Max and Annie bring up the matter of having a kid, which seems like less of something Max wants, which Annie deduces is because he wishes he were more like Brooks.Ryan spots the egg in a vault and goes to grab it while everyone watches the fight. Unfortunately, he is spotted, and he runs away with the egg. Anderton's guards chase the group as they run around the house with the egg, but they finally manage to take it and leave the house.The group arrives at the bridge where they must meet the kidnappers, but Kevin hits the brakes too hard, and the egg goes flying and shatters against the dashboard. They notice that something was inside the egg - a list of people in witness protection. The group approaches the kidnappers with the paper, and they force the group to get on the ground. While they speak to their employer, Brooks apologizes to Max for how he treated him and for lying to him. He tells Max the keys to the Stingray are in his jacket pocket. The kidnappers then decide to execute the group until Gary arrives and shoots them. Gary figured that something suspicious was up with the group with how they acted all night. One of the kidnappers then shoots Gary. Max and Annie go to help him until Max notices a blood capsule fall out of Gary's mouth. He reveals that he hired the kidnappers to take over Brooks's game night so that he can get back in the game. When the group hands him the WitSec list, Gary says he wasn't in on that. Then, The Bulgarian (Michael C. Hall) appears with his bodyguard and shoots Gary for real. Brooks swallows the list, so the villains take Brooks with him to their jet.Max and Annie run to Brooks's house to take the Stingray and drive to the jet. As the jet is preparing to fly, Max manages to take out the wheels and cause the jet to go down. The Bulgarian's guard goes after the couple. Annie tries to distract the guard while Max goes to save Brooks. Max fights The Bulgarian while Annie is held at gunpoint by the guard. In the fight, the turbines go on, causing the guard to get sucked in and get shredded. Annie then knocks out The Bulgarian with a fire extinguisher, and the two of them free Brooks. He tries to play it off like this was also part of the game, but he's just kidding.Three months later, the gang gathers at Brooks's house for game night since he is serving 3 years of house arrest. He says it's not all bad since he sold the WitSec list on the black market for $3 million and also tipped off the people on that list for $20,000 a pop. The group even has Gary rejoin them, but he still sucks at the games. They play Pictionary, and Annie uses it to announce to Max that she is pregnant. The two of them embrace while their friends congratulate them. We then pan outside to see two guys in masks with guns preparing to go into the house.During the closing credits, we see a detailed look at how Gary planned to hijack Brooks's game night. After the credits, we see the man that Michelle mistook for Denzel meeting a new woman - Debbie.", "language": ["English"], "release_date": "23 February 2018", "viewer_count": "48448"}, {"movie_name": "The Shape of Water", "movie_year": "2017", "actors": ["Sally Hawkins", "Octavia Spencer", "Michael Shannon"], "director": "Guillermo del Toro", "writers": ["Guillermo del Toro", "Vanessa Taylor"], "genres": ["Adventure", "Drama", "Fantasy", "Horror", "Romance", "Thriller"], "review_rating": "7.4", "keywords": ["underwater scene", "mute woman", "creature", "interspecies romance", "sign language"], "user_review_count": "996", "critic_review_count": "916", "synopsis": "The film opens as we go through a home that appears to be underwater. We hear the voice of a man named Giles (Richard Jenkins) mention the story of a princess, the one she loved, and the monster that threatened to tear them apart.Baltimore, 1960's - Elisa Esposito (Sally Hawkins) is a mute woman who lives alone but frequently spends time with Giles, her neighbor. She works at the Occam Aerospace Research Center as a janitor with her friend Zelda Fuller (Octavia Spencer). During their shift, a vessel is brought into the facility containing a valuable asset. Elisa goes near the vessel, and something bumps against it from inside.Giles takes Elisa to his favorite pie shop where he frequently gets key lime pie. Elisa doesn't like it, but Giles enjoys the pie, as well as the conversations he has with the shop's \"Pie Guy\" (Morgan Kelly), whom Giles has a crush on. We also see Giles working on an ad design for a jello product for the company that he used to work for before being suspended, apparently because of a drinking problem.At work, Elisa and Zelda are cleaning a bathroom when Colonel Richard Strickland (Michael Shannon) comes in and splashes some water after washing his hands before he uses the urinal. A while later, the ladies hear a scream coming from another room, and Strickland emerges with two fingers missing from his left hand. Elisa and Zelda must clean the blood in the room where they are keeping the new \"asset\". Elisa splashes a bucket of water on the floor, and Strickland's fingers come out from under a shelf. Elisa packs them in a bag to send to the hospital with him.Elisa discovers that the Asset (Doug Jones) is a fish-like humanoid creature. She becomes fascinated by it and starts sneaking into the enclosure to spend time with it. Elisa feeds it hard-boiled eggs, teaches it sign language, and plays music records to listen to. She hides when she hears someone enter. It's Strickland, coming to torture the Asset by zapping it with a cattle prod, merely to taunt it out of spite for his fingers.A new doctor at the facility, Robert Hoffstetler (Michael Stuhlbarg), is actually a Soviet spy named Dimitri. He meets with his bosses, who take him to a restaurant to discuss the Asset. Hoffstetler tells the men that he believes the creature can communicate and is intelligent. The bosses later give Hoffstetler a poison to kill the creature to prevent the Americans from advancing their scientific research. Meanwhile, Strickland's own boss, General Hoyt (Nick Searcy), wants to harvest the Asset's body for space travel technology.Elisa becomes fearful for the Asset's safety and lets Giles know that she wants to help it. Giles doesn't think it's a good idea, but Elisa sees no difference between the creature and herself as they are both individuals that are unlike regular people, and she is worried that if she does nothing, it will die.Giles pays another visit to the pie shop. He starts a friendly conversation with Pie Guy until Giles reaches out to touch his hand, and the man reacts angrily. It gets worse when an African-American couple enters and he tells them they can't sit at the counter. Giles is also told to leave.Giles decides to help Elisa break out the Asset and uses his skills to decorate a van and make a fake ID. Elisa initiates their plan by turning cameras away from the enclosure. She sneaks the Asset into a laundry hamper and wheels it away while Giles drives into the facility. Zelda is leaving work, but realizes what Eliza is up to.At the same time, Hoffstetler is also preparing to take action, apparently to carry out his orders, but he discovers Elisa's plan and decides to help her. He shuts down power with a bomb device and uses a syringe on a guard. Strickland rushes to the exit, but is too late. Helped by Zelda and Hoffstetler, Elisa gets the creature inside the van, and Giles drives them away, wrecking Strickland's new car in the process.Elisa brings the Asset to her apartment and keeps it in her tub with chemicals that Hoffstetler gave her, plus some salt to keep it healthy. When she goes to work the following night, Strickland interrogates her and Zelda but doesn't believe they could have been responsible. As she leaves, Elisa signs \"fuck you\" to Strickland, which Zelda translates as \"thank you\".While Giles is tending to the Asset, he falls asleep. The Asset gets out of the tub and sees one of Giles's cats. The cat hisses at the Asset, and it growls back before it starts to eat the cat. Giles sees this and frightens the Asset. It runs out, scratching Giles's arm. When Elisa returns, Giles tells her what happened. She runs out to look for it, only to find it in the movie theater beneath the apartments. She brings it back upstairs and tends to it. The Asset touches Giles's head and arm, and it starts to glow a blue color.In the morning, Giles discovers hair on his head where there previously was none. The cut on his arm is also completely healed.Elisa and the Asset grow closer, and they make love in the bathroom. Elisa even floods the bathroom so that they can swim together, but it causes a leak into the theater, and Giles is forced by the theater owner to open the door and let the water out. She eventually plans to free the Asset into a canal with rainwater flooding it. Elisa grows more attached to the Asset, even imagining a scenario where she is in an old-timey musical number singing about her love for him.General Hoyt visits the facility to chastise Strickland for losing the Asset and gives him 36 hours to find it.Hoffstetler's own bosses realize he didn't kill the Asset, but they spare Hoffstetler for the time being, telling him he will be extracted in two days time.On the day that Elisa plans to release the Asset, Zelda comes over and sees that its scales are peeling off, and they are out of the chemicals from the facility. They plan to take the Asset away that night.Strickland follows Hoffstetler to his rendezvous point where he always meets his bosses. They shoot Hoffstetler repeatedly, but before they can finish him off, Strickland shows up and kills them first. He grabs Hoffstetler by the bullet hole in his cheek and tortures him to give up the Asset's location, thinking he is hiding it for other Soviet spies. With his dying breath, Hoffstetler laughs at Strickland and says, \"No names. No rankings. They just clean.\"Strickland then goes to Zelda's home to interrogate her and her husband Brewster (Martin Roach). Growing more mad and delusional, he tears off the two fingers on his hand that hadn't healed after being reattached. Zelda is silent, but Brewster tells him that Elisa has the Asset. After Strickland leaves, Zelda scolds Brewster and then calls Elisa to warn her. She and Giles take the Asset away before Strickland shows up. He breaks into Elisa's apartment and sees the note on her calendar that lets him know she's taking the Asset to the canal.Elisa and Giles bring the Asset to the canal. They say their goodbyes to the creature, but it signs to Elisa, \"Me and you together forever.\" She responds that he must go without her. Strickland shows up and punches Giles in the face before shooting both the Asset and Elisa. Thinking he just won, Strickland turns to leave but gets whacked in the face by Giles. The Asset revives itself and heals its own bullet wounds. Strickland is impressed and calls the Asset a god before it slashes Strickland's throat with its claws. Just as the police arrive, the Asset takes Elisa into the water as Giles and Zelda (who just arrived) watch.Underwater, the Asset kisses Elisa, using its healing powers to revive her and give her gills where there were once scars on her neck. The two hold each other as Giles's voice closes the film saying that the two of them could now be together.", "language": ["English", "American Sign Language", "Russian", "French"], "release_date": "16 February 2018", "viewer_count": "210181"}, {"movie_name": "Bad Samaritan", "movie_year": "2018", "actors": ["Kerry Condon", "David Tennant", "Robert Sheehan"], "director": "Dean Devlin", "writers": ["Brandon Boyce"], "genres": ["Horror", "Thriller"], "review_rating": "6.3", "keywords": ["burglar", "maserati", "captive", "bound and gagged", "tied to a chair"], "user_review_count": "32", "critic_review_count": "28", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["English"], "release_date": "4 May 2018", "viewer_count": "1161"}, {"movie_name": "Book Club", "movie_year": "2018", "actors": ["Diane Keaton", "Jane Fonda", "Candice Bergen"], "director": "Bill Holderman", "writers": ["Bill Holderman", "Erin Simms"], "genres": ["Comedy"], "review_rating": "null", "keywords": ["reference to fifty shades of grey", "book club", "woman"], "user_review_count": "null", "critic_review_count": "null", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["English"], "release_date": "18 May 2018", "viewer_count": "null"}, {"movie_name": "Wonder Woman", "movie_year": "2017", "actors": ["Gal Gadot", "Chris Pine", "Robin Wright"], "director": "Patty Jenkins", "writers": ["Allan Heinberg", "Zack Snyder"], "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi", "War"], "review_rating": "7.5", "keywords": ["mini dress", "caught naked", "woman wearing a miniskirt", "woman wearing a short skirt", "long haired woman"], "user_review_count": "1770", "critic_review_count": "642", "synopsis": "In the opening scene in modern day Paris, France, Diana Prince (Gal Gadot) visits the Louvre as a van from Wayne Enterprises pulls up. She receives a briefcase sent by Bruce Wayne. Inside is an old photograph of Diana alongside four men during World War I. With the picture is a note from Bruce saying he would like to hear the story behind the picture.As a child, Diana (played by Lilly Aspell) grew up on the island of Themyscira alongside the mighty Amazons, an all-female warrior clan. She watches the warriors training on the field under General Antiope (Robin Wright). Diana wants to be a fighter like the rest of the Amazons, but her mother, Queen Hippolyta (Connie Nielsen) forbids her daughter from training.Hippolyta takes Diana and tells her the story about the gods. Zeus ruled over the heavens and looked upon mankind with high regards, but Ares, the god of war, sought to corrupt mankind and lead them to tear each other apart in battle. The other gods fought back against Ares, but he killed all of them. With his dying breaths, Zeus cast Ares down into the world of man and then forged a weapon that can destroy Ares once and for all. He also gave the Amazons their home on Themyscira to hide them from the rest of the world. Hippolyta shows Diana the powerful sword known as the God Killer. With it, Ares can be killed, but Hippolyta hopes there will not come a time for Diana or anyone else to wield it.Antiope convinces Hippolyta to let her train Diana, wanting her to be ready to face Ares, because they all know he's still out there. Hippolyta reluctantly agrees. Through the years, Antiope subjects Diana to harsh and intense training in the field. As she reaches adulthood, Diana continues training to be as fierce as the other Amazons. During one session, Antiope pushes Diana hard with her swordplay, leading Diana to defend herself by deflecting the sword with her gauntlets. This causes Antiope to fly back and hurt herself. Diana shows great remorse for hurting Antiope. She leaves in shame, but Antiope is far from upset.Diana runs over to a cliff. In the distance, a plane passes through the barrier into Themyscira before crashing into the ocean. Diana dives into the water and swims toward the plane. A pilot named Steve Trevor (Chris Pine) is sinking as he cannot break himself free from his seat. Diana pulls him out of the plane and takes him to shore. As she becomes surprised to see a man for the first time, German soldiers following Steve make it past the barrier as well. The Amazons arrive as they find Diana with Steve, but also see the Germans. The Amazons ready their arrows, and the Germans aim their rifles. The arrows are launched and shots are fired. The Germans make it to the shore and battle the Amazons. Several Amazons are shot dead while the Germans get taken out easily. Antiope fires three arrows at once to kill three soldiers. One soldier aims his gun at Diana, and Antiope leaps in to take the shot. Diana rushes to Antiope's side. As she dies, she tells Diana it is her time to wield the God Killer.Steve is interrogated before all the Amazons with the Lasso of Truth. He is forced to confess that he is a spy with the Allied forces. Steve explains to the Amazons about World War I and how he has learned of a sinister plan by Germany's General Erich Ludendorff (Danny Huston) and his chief chemist Dr. Isabel Maru, AKA Dr. Poison (Elena Anaya). They are concocting a new bio-weapon, which Steve claims is unlike anything he's seen before and tells the Amazons they are in more danger than they realize. Steve acted as a spy in the German army before stealing Maru's notebook and flying away with it as he destroyed the Germans' other planes until they followed him to the island. Diana realizes this must be the work of Ares.Steve is allowed to bathe in the Amazons' fountain to replenish himself. Diana walks in and accidentally sees him nude. She asks what \"that\" is, and Steve says it is his father's watch, which he says he follows to let him know what to do in the day. Diana is confused by the device and its uses.Still fearing that Ares is behind the ongoing war, Diana grabs her shield, lasso, and then takes the God Killer sword from its holding, along with her battle suit. She goes to tell Steve she will help him get home if he takes her to Ares. The two head for the shore but are approached by Hippolyta and other Amazons. Diana is insistent that she goes out there to stop Ares and end the war. Hippolya tearfully embraces her daughter one last time and tells her she has always been her greatest love, but today she is her greatest sorrow. She gives Diana Antiope's tiara as a parting gift, but warns her that if she leaves she may not be able to return to Themyscira. As Diana and Steve depart, Hippolyta confides to an Amazon that Diana can't know what she really is, or else Ares will find her faster.Diana and Steve arrive in London. The two meet with Steve's secretary, Etta Candy (Lucy Davis). Before they can deliver Maru's notebook to Steve's superiors, they find Diana an appropriate outfit to wear so she can blend in for the time. Diana and Steve are then cornered by some men in an alley. They draw their guns, but Diana beats them all down, even letting Steve punch the last guy out.Ludendorff meets with Maru in her lab. She has developed a new type of gas for the general so that he may maintain his super strength. Maru then comes across a formula on her table, which she thinks is the breakthrough they've been looking for.Diana and Steve head on over to a meeting held by Sir Patrick Morgan (David Thewlis), who is planning to negotiate an armistice with Germany. The men in the room are immediately distracted by Diana's presence. Steve is forced to take her outside. Later, he presents Sir Patrick with the notebook. Since the writing is in Sumerian, Steve has Diana (who speaks hundreds of languages) translate it for the other men. They learn that Ludendorff and Maru are planning to create a new kind of hydrogen-based mustard gas that would be far more lethal to the soldiers. After hearing that the British general is planning to send his troops to the Western Front and go in to most likely get killed, Diana becomes enraged and tells the general that a good leader would fight alongside his men. Steve pulls Diana out again as she tells him that she believes Ludendorff is Ares in disguise. Steve confides to Diana that he will personally take her to the Front.Steve brings Diana to meet his teammates. They first stop at a pub and find Sameer (Said Taghmaoui), a spy who is instantly attracted to Diana. Next is Charlie (Ewen Bremner), whom Steve says is a skilled marksman, but they find him getting beaten up by another man for accidentally taking his glass. The man attempts to shoot Charlie, but Diana intervenes and knocks the man down. The four then head out to meet The Chief (Eugene Brave Rock), a smuggler.Ludendorff meets with some of his comrades to discuss what he has planned. After they express some doubts and lack of confidence in his work, Ludendorff and Maru demonstrate their work by throwing the gas bomb in the room, killing all the men.The team makes it to the Front. They walk through the trenches, and Diana speaks to a local woman who is distraught over what has been taken from them by the German army. Not wanting to wait any longer, Diana dons her tiara and steps out into the battlefield with her armor. The German soldiers begin to fire upon her, but she easily deflects their bullets with her gauntlets. Diana proceeds to beat down the enemy soldiers while Steve and his team follow. Once she takes out most of the soldiers on the ground, the men help Diana leap to a sniper tower, which she instantly demolishes. The townspeople celebrate and cheer for Diana.Steve later learns that Ludendorff will be attending a gala the next day. He has Etta locate the area for him, but Sir Patrick urges Steve not to go ahead and do it. Steve naturally ignores him. He then tells Diana about the gala and how she would be unprepared for it, so he shows her how to dance. They go up to a room to be alone, and they share a kiss.The team heads over to the gala in disguise. Steve pretends to be a German officer with Sameer being his driver as they improvise entering without an invitation. Diana finds a snooty woman and steals her dress. Steve attempts to sweet-talk Maru to get more information, but he becomes distracted when he sees Diana enter in the blue dress. Diana sees Ludendorff and gets ready to kill him, but Steve stops her from messing up the plan. However, Ludendorff proceeds to launch gas bombs into the nearby town. Diana runs ahead but is too late. She sees the townspeople dead in the streets and can only look on with despair. Steve runs by and Diana is angry with him for not letting her kill Ludendorff before this happened.It is learned that Ludendorff plans to use a plane to drop a number of gas bombs down on London. Diana rushes to an airbase where the German soldiers are gearing up for their attack. Diana beats down some soldiers before making her way to Ludendorff. He inhales Maru's strength gas and fights Diana. Ludendorff puts up a good fight until he runs to the roof. Diana bursts through and impales Ludendorff with the God Killer. He dies but Diana sees that the soldiers are still pushing the gas bombs into the plane.Steve shows up and Diana is confused as to why the war isn't over if she killed Ares. Steve says that maybe the war isn't a result of a god but rather that there are just bad people out there. He leaves, and Diana looks back inside Ludendorff's office to see Sir Patrick. Diana realizes it is him that is really Ares. He tells Diana how he only provided secret influence to people like Ludendorff and Maru to get their work going, but it was their own evil, as well as the darkness of other men, that led to the war. Diana tries to kill Ares with the sword, only for him to destroy it. He tells Diana that it is she who is the real weapon forged by Zeus. She is the real God Killer. Using the Lasso, Ares shows Diana what can happen if she joins him and if they rid the world of mankind. She refuses, and they begin to fight.Steve and his team get past the Germans. They consider shooting the plane down, but the explosion would kill anyone within 50 Miles. As Diana and Ares' fight extends onto the tarmac, Steve runs by Diana, says something quick, and he gives her his father's watch. He hijacks the bomber plane and flies it away. As he gets high enough, Steve aims his gun at the bombs. He takes a moment to consider what he's doing, but he knows what he has to do. He shoots the bombs, sacrificing himself as the plane blows up. Diana sees this and yells in agony. Ares only uses this to try and sway her even more to join him as he dons his armor. Ares brings Maru before Diana and removes Maru's mask to reveal her disfigured face. He tries to convince Diana to kill her. Diana lifts up a tank, but she recalls what Steve just told her. He said he can save the day, but she can save the world. He told her he loved her before taking the plane. Diana drops the tank and lets Maru get away. Diana tells Ares that she believes in love. Ares fires a blast of energy at Diana, but she absorbs it with her gauntlets and directs it back toward Ares, destroying him for good. The soldiers are then broken free of their corruption.Everyone celebrates the end of the war. Diana sees a wall of the fallen heroes, including Steve.Back in the present, Diana sends a message to Bruce Wayne, thanking him for the photograph and letting her keep a piece of Steve. Her voice-over then reassures that she will continue dedicating her life to justice. With that, Diana leaps across the sky to continue her work as...WONDER WOMAN.", "language": ["English", "German", "Dutch", "French", "Spanish", "Chinese", "Greek, Ancient (to 1453)", "North American Indian"], "release_date": "2 June 2017", "viewer_count": "409083"}, {"movie_name": "Newton", "movie_year": "2017", "actors": ["Rajkummar Rao", "Pankaj Tripathi", "Anjali Patil"], "director": "Amit Masurkar", "writers": ["Amit Masurkar", "Mayank Tewari"], "genres": ["Comedy", "Drama"], "review_rating": "7.8", "keywords": ["election", "officer", "honesty", "duty", "forest"], "user_review_count": "72", "critic_review_count": "28", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Hindi"], "release_date": "22 September 2017", "viewer_count": "8399"}, {"movie_name": "Toilet - Ek Prem Katha", "movie_year": "2017", "actors": ["Akshay Kumar", "Anupam Kher", "Bhumi Pednekar"], "director": "Shree Narayan Singh", "writers": ["Garima", "Siddharth"], "genres": ["Comedy", "Drama"], "review_rating": "7.4", "keywords": ["toilet", "husband wife relationship", "father son relationship", "village", "social drama"], "user_review_count": "65", "critic_review_count": "23", "synopsis": "Keshav and Jaya are from two villages near Mathura, where at least 80% of households are without any access to a lavatories. Conflict comes knocking on the first day of their marriage, when Jaya leaves Keshav's house for good, after discovering that there is no toilet in the home. Distraught and desperate, Keshav sets out on mission to win back his love- by battling against the age old traditions, mind-set and value system of his country.", "language": ["Hindi"], "release_date": "11 August 2017", "viewer_count": "11032"}, {"movie_name": "Bareilly Ki Barfi", "movie_year": "2017", "actors": ["Ayushmann Khurrana", "Kriti Sanon", "Rajkummar Rao"], "director": "Ashwiny Iyer Tiwari", "writers": ["Bareilly Ki Barfi", "Shreyas Jain"], "genres": ["Comedy", "Romance"], "review_rating": "7.5", "keywords": ["f rated"], "user_review_count": "52", "critic_review_count": "22", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Hindi"], "release_date": "18 August 2017", "viewer_count": "7101"}, {"movie_name": "Baahubali 2: The Conclusion", "movie_year": "2017", "actors": ["Prabhas", "Rana Daggubati", "Anushka Shetty"], "director": "S.S. Rajamouli", "writers": ["Vijayendra Prasad", "S.S. Rajamouli"], "genres": ["Action", "Drama", "Fantasy", "War"], "review_rating": "8.4", "keywords": ["sequel", "second part", "fight", "battle", "sword"], "user_review_count": "435", "critic_review_count": "58", "synopsis": "The film opens with a brief prologue from the previous movie for those who have not seen it:A severely injured woman who seems to be on the run from assailants, prays to God to save the small child she is carrying. That is when Sanga (Rohini) and her husband, part of a tribe living in the province of the kingdom, save a drowning infant, not knowing the background of the infant, or what the future holds for him.He grows up as Shivudu, a free-spirit wanting to explore the mountains and in the process learns of his roots from the kingdom, and his parents and then realizes the whole purpose of his life and ends up confronting the mighty Bhallaladeva for his rightful place.The PastAt the conclusion of the big battle from the last movie, Amarendra Bahubali (Prabhas) having defeated Kalakeyas, is declared King by the Mother Queen Sivagami (Ramya Krishnan) over Bhallaladeva (Rana Daggubatti), who instead is given charge of the armies as a commander.There is a tradition in the kingdom that the daughter-in-law of the royal family is required to perform a sacrifice every so often by carrying hot coals in a container above her head and walk around the temple to ward off evil spirits. Sivagami carries this out as she is the only daughter-in-law of the family. Amarendra Baahubali proves his might again as he stops a disgruntled elephants that escaped its harness and was charging in the direction of Sivagami. The ceremony was carried out because Amarendra Baahubali was to ascend the throne as King.Declaring Amarendra Baahubali King does not ease the tension between the two step-brothers and rivals as Bhallaladeva considers himself the rightful King, being the biological son of the Mother Queen. As we found out in the previous movie, Amarendra Bahubali is the son of the old King, and his mother died giving birth to him. The Kings brother was seen as too weak and cowardly to take over the throne, so his wife Sivagami, sister-in-law of the King had the conspirators to the throne killed and assumed the throne herself. She was to hold power until one of the two princes proved he was capable enough of taking over the responsibility of the throne.Since Amarendra Baahubali was to take over the throne, Sivagami orders him to travel throughout the kingdom and surrounding areas and become familiar with the people and various smaller kingdoms that existed within the land so that he understood the land and the state of the people he would be ruling over. She also sends Katappa (Sathyaraj) along with him as a companion and bodyguard. In the meanwhile, the Sivagami would prepare for his coronation and search for a suitable bride.During their travels, Amarendra Baahubali and Katappa come across a village that is being attacked by bandits. There they see Princess Devasena (The woman enslaved in the royal court yard, collecting small pieces of wood from trees in a fire pit in the first movie) (Anushka Shetty), take on group a group of bandits and defeat them without much effort, while other, other men from the village fight rest of the bandits. The villagers are being led by Devasenas cowardly cousin Kumara Varma (Subbaraju). Amarendra Baahubali and Katappa also assist the villagers by quietly taking on a group of bandits hiding in the forest nearby. Amarendra Baahubali becomes infatuated with Devasena when he sees her fighting. Devasena is a princess of the Kuntala Kingdom and the sister of the ruling King. After the fight is over, the two manage to convince the princess and her cousin that Amarendra Baahubali and Katappa are uncle and nephew and that Amarendra Baahubali is an uneducated fool who was kicked out by his family for being an idiot. Kattappa manages to convince Devasena that they are simple travelers and asks her to take them in. During their stay within the palace, Devasena manages to figures out AB is not a fool but rather just putting on an act. He flirts with her during their stay falls in love with her and because she enjoys his flirtation does not call him out and just plays along.Back at the palace, Bhallaladeva learns from his spies that Amarendra Baahubali is pretending to act like a fool in order to woo Princess Devasena. He becomes infatuated with Devasena when he sees the picture he received of her. Before Amarendra Baahubali can act on his desire to marry Devasena and inform Sivagami, Bhallaladeva convinces her of his desire to marry Devasena. Not knowing about the burgeoning romance between Amarendra Baahubali and Devasena and feeling guilty for passing over her biological son in her choice for king, she promises him that Devasena would marry her son.Subsequently, Sivagami sends a messenger to Devasenas kingdom for her hand in marriage to Bhallaladeva; however, the messenger belittles the Kuntala kingdom and insults Devasena saying she should be grateful for having been offered a proposal from such a prominent kingdom. The princess in return insults the messenger and turns him away refusing the marriage proposal. Kattappa and Amarendra Baahubali who do not know that marriage proposal was on behalf of Bhallaladeva take the proposal from the messenger as meaning that Sivagami on her own decided to marry Amarendra Baahubali to Devasena. Since Devasena does not know yet that Amarendra Baahubali is the future King, he does not step forward to reveal his actual identity.A little while after Devasenas kingdom is attacked by an organized band of robbers. Amarendra Baahubali is forced to reveal himself as a warrior in order to fight alongside Devasena and defeat the enemy. Following the battle, he declares his love for Devasena and asks her to come back with him to his kingdom as his bride. Devasenas family is supportive and approves of the match.Although Amarendra Baahubali had received an order from Sivagami to take Devasena as a prisoner for insulting her offer, he tells Devasena that he will protect her, and she can come with him back to his kingdom. Once they explain the situation to Sivagami, she will accept their relationship, and it would all turn out fine.Things do not go as planned. Devasena and Sivagami almost instantly dislike each other. Devasena also declares that she will not marry Bhallaladeva because she does not love him and refuses to be forced to marry someone she does not love. Sivagami takes Devasena's refusal as an insult against her, partially because she still feels a little guilty for making Amarendra Baahubali King instead of Bhallalldeva and orders the guards to arrest her. Because Amarendra Baahubali had promised Devasena that he would not allow her to be harmed, he comes to her defense. He goes against the orders of Sivagami and refuses any harm to come to her. The actions of Amarendra Baahubali infuriate Sivagami. By choosing another woman over the Queen Mother, Amarendra Baahubali dishonored not only the Queen Mother but also the laws of the kingdom. Thus Sivagami gives Amarendra Baahubali an ultimatum. He will have to choose between being King or Devasena. Amarendra Baahubali having fallen in love with Devasena, naturally, chooses her over being King.As a result of Amarendra Baahubali's choice, Bhallaladeva is crowned the new King. Amarendra Baahubali is given Bhallaladevas old job as commander of the army. At the coronation ceremony, the people and guards at the palace cheer louder for Amarendra Baahubali when he is crowned the commander, shaking the throne by stamping the ground with their spears. Clearly, they still see him as their King. This only serves to infuriate Bhallaladeva even more. He decides that Amarendra Baahubali must not hold any power or he will continue to be a threat to his rule and de-legitimize him.The tension between the two step-brothers persists as Bhallaladeva uses every opportunity he can to drive a wedge between Amarendra Baahubali and Sivagami. He particularly uses Sivagamis dislike of Amarendra Baahubalis wife Devesana as a factor in driving the wedge even deeper. Bhallaladeva even goes as far as creating situations where Devasena appears to be in the wrong, and Amarendra Baahubali is forced defend her. When Devasena becomes pregnant, he relieves Amarendra Baahubali of his command over the army so he can spend more time with his wife. However, it was a ploy to strip Amarendra Baahubali of any power he held in the Kingdom; this becomes another fight between Devasena and Sivagami because Devasena accuses Sivagami of sitting idly by while her son takes all control. Slowly all forms of power are stripped from Amarendra Baahubali, and the Queen Mother Sivagami has been turned against him by Bhallaladeva. Once the tensions reach a boiling point at the order of Sivagami, Amarendra Baahubali and Devasena are exiled from the kingdom forced to go and live among the peasants.The couple now living at a workers village are still happy with their life having each other is enough for them. Amarendra Baahubali helps the villagers by creating tools for them so that they do not have to work as hard, while Devasena, having gotten further along in her pregnancy is preparing for the birth of her child.Back at the palace, Bhallaladeva still paranoid about the influence Amarendra Baahubali has and comes to the conclusion that as long as Amarendra Baahubali is alive, he poses a threat to his crown. Thus he comes up with a plan that would have the Queen Mother Sivagami herself order the death of Amarendra Baahubali. Bhallaladeva has Devasenas cousin Kumara Varma overhear a conversation between himself and his co-conspirator father, Sivagamis conniving but cowardly husband Bijjaladeva (Nassar). Bhallaladeva and his father pretend to have an argument where he wants to have Amarendra Baahubali killed, but his father pretends to be against the plan. This fools Devasenas cousin Kumara Varma into believing that Bhallaladevas father could be trusted and asks him for help so that Amarendra Baahubali is not harmed. Bhallaladevas father for his part of the plan convinces him that the only way to protect Amarendra Baahubali is to kill Bhallaladeva. When the plan is carried out, and Kumara Varma attacks Bhallaladeva, it turns out to be a trap, and Kumara Varma is killed. Bhallaladeva injures himself and then goes to the Queen Mother, Sivagami. Since it was Devasenas cousin that attacked him, he convinces her that Amarendra Baahubali is the one that sent Kumara Varma as an assassin to kill him out of jealousy of losing the throne and his command of the army.Sivagami, still angered at Amarendra Baahubali's betrayal of having chosen Devasena over her, is now convinced that Amarendra Baahubali would be capable of doing such a thing as having Bhallaladeva assassinated. Because Amarendra Baahubali is still popular among the people, he cannot be killed outright as it would cause lots of internal fighting. Therefore Sivagami, orders Kattappa to assassinate him quietly. Since Kattappa is bound to serve the royal ruler, he cannot refuse the order. The plan is to have a group of rogue warriors chase after Kattappa into the village that Amarendra Baahubali is living in with his wife. While this plan is unfolding, Amarendra Baahubali's wife is giving birth, but Amarendra Baahubali is forced to leaves his wife to go and help Kattappa. Although the warriors are able to injure him, none of them are able to kill him. Amarendra Baahubali kills them all, and it is up to Kattappa to finish the job. When Amarendra Baahubali's back is turned towards Kattappa, he plunges his sword into his back. After Amarendra Baahubali has died, Bhallaladeva comes to gloat over the dead body of at his victory and expresses his level of depravity by hacking away at the dead body with an ax. Bhallaladeva also believes that Kattappa is his loyal dog and in his zeal at having won reveals his entire devious plan to have Amarendra Baahubali assassinated by the order of the Mother Queen. Kattappa immediately rushes off to tell the Mother Queen of what Bhallaladeva had done and that Amarendra Baahubali had never done anything wrong. This leaves the Mother Queen Sivagami in shock having finally realized what she has done.Devasena in the meanwhile had given birth to her son (young Mahendra Baahubali) and while she is still struggling, makes her way to the palace with her new baby and is shocked to learn of the death of her husband. When Bhallaladeva returns, he asks his mother to go to the palace balcony and address the people, informing them of Amarendra Baahubali's death. Instead, she takes the baby out on the balcony to declare that the baby is the new ruler of the kingdom and Kattappa takes a vow to protect and serve him. Bhallaladeva enraged at Sivagami's declaration has the guards attack her, but she manages to escape with Kattappa's help on a boat through the water canals running through the massive palace. While she is escaping Bhallaladeva shoots an arrow into her back (the arrow we saw at the start of the last movie), and she drops into the canal/river, possibly drowned and dead along with the baby. Devasena who is still struggling after having given birth is captured by Bhallaladeva and imprisoned in the palace court yard.Present Day (25 years later)In the present day, Mahendra Baahubali (Also played by Prahbas), son of AB and Devasena is enraged after hearing the story of what happened to his parents. He orders Kattappas elite troops, the rebels he was helping to rescue Devasena (from the first movie) not realizing she was his mother and all of the people from his village to prepare for battle against Bhallaladeva and his army to take back the kingdom.When Bhallaladeva learns of the threat he orders his troops to attack, and he comes out of the palace on his massive chariot, recaptures Devasena and returns to the palace closing the massive draw bridge leading into the palace once he is safely inside.Mahendra Baahubali and his men manage to get into the city by bending long trees and using them as catapults to launch themselves over the palace walls while using their shields to make a protective shell around them. Once the groups make it inside the palace walls, the draw bridge is opened for rest of the troops to breach the palace and take the battle to the courtyard of the palace. Mahendra Baahubali goes directly to fight Bhallaladeva. The fight is evenly matched with both warriors showing their might. While everyone else is fighting Devasena, starts the sacrificial ceremony that Sivagami had completed a long time ago. Obstacles are thrown in her path, and a bridge that she needed to cross is lit on fire, but a pathway magically seems to clear for her to continue her journey around the temple to complete the ceremony. Mahendra Baahubali who finally gains the upper hand in his fight against Bhallaladeva, wraps his fists in metal chains and punches Bhallaladeva into submission. Bhallaladeva is beaten into the area Devasena was held captive for twenty-five years. The wood that Devasena had been collecting was covered in oil when the palace guards lit the bridge on fire from before. When Bhallaladeva is beaten onto the pile of sticks by Mahendra Baahubali, Devasena completes her journey exactly where he lies beaten. She dumps the coals on him setting him on fire.We are taken forward in time to Mahendra Baahubali's coronation. He is blessed by his adoptive mother Sanga (Rohini), and then the Kings crown is placed on his head by his biological mother. The movie ends with Mahendra Baahubali declaring peace.", "language": ["Telugu", "Tamil", "Hindi", "Malayalam"], "release_date": "28 April 2017", "viewer_count": "56799"}, {"movie_name": "Secret Superstar", "movie_year": "2017", "actors": ["Zaira Wasim", "Meher Vij", "Raj Arjun"], "director": "Advait Chandan", "writers": ["Advait Chandan"], "genres": ["Drama", "Family", "Music", "Musical"], "review_rating": "8.1", "keywords": ["f rated", "teenager", "teenage girl", "teenage boy", "15 year old"], "user_review_count": "81", "critic_review_count": "27", "synopsis": "The story of Secret Superstar is set in the town of Vadodara (Baroda) in Gujarat, India. Insia Malik (Zaira Wasim), a 15-year-old Indian Muslim girl, lives with her mother Najma (Meher Vij), younger brother Guddu, and an overbearing father Farookh (Raj Arjun). Insia is very passionate about singing, but her father is against her dream of becoming a singer.Farookh goes out of town for work, and returns only once a week. Insia wants to participate in a music contest, which has a laptop and one free year of internet as a prize. Her mother tells her to get the permission of her father, but Insia never gets the chance as her father is busy scolding her and her mother. To satisfy her, Najma gifts Insia a laptop. Delighted with her present, Insia spends all her time on the laptop. She soon discovers that people have been using YouTube as a platform to record and post their songs. Insia records a song while disguising herself in a burkha, so Farookh can't find out her identity, and uploads the video on YouTube under the name of 'Secret Superstar'. She becomes an overnight sensation and grabs the attention of Shakti Kumar (Aamir Khan), who is a talented but rude music director and was a once successful singer. Shakti Kumar requests Insia to come to Mumbai for recording a song, but Insia refuses as she has heard a lot negative reviews of Shakti.One day, Insia sees her tuition teacher's husband read an article about the Secret Superstar in the newspaper. Scared that her father will read the article too, she leaves the test to run home and hide the newspaper. Chintan, who has a crush on Insia, follows her, and tells her that he knows she is the 'Secret Superstar', recognizing her voice. Later he also proposes her in reply Insia with a blushing smile on her face ask him to leave.As she had left her test, Insia got very poor marks. Enraged, Farookh breaks her guitar.Farookh is about to take Najma to a party and asks her to wear a necklace, when Najma starts making excuses. Realizing that Najma has sold it to buy the laptop, Insia takes her mother to another room to talk to her, but her father overhears them both. Furious, Farookh beats his wife and asks her to throw away the laptop. In a fit of rage, Insia herself throws away the laptop form the balcony and breaks down in her mother's arms. After seeing a famous lawyer on TV who fought against Shakti Kumar and won, Insia decides to approach her to get advice on divorce. With no other choice left, Insia accepts Shakti Kumar's proposal and goes to Mumbai, escaping school with help from Chintan. While escaping Chintan helps Insia jump out of school wall, after she is out she reveals that she too loves him [ Chintan ]and then leaves .In Mumbai, Insia is initially unable to sing the party song, as she feels that the lyrics and the beats do not match. She tells Shakti that the song feels like a remix of another song which is never made, and Shakti tells her it's true. He sings the song as he original wrote it, and Insia realises what a good singer Shakti really is. Shakti tells her that the song is too slow for the generation today, as they all want fast-paced party songs. Insia asks Shakti to give the original song a try, and when she sings it, everyone is surprised and moved. The song is then recorded. The secret superstar's fame increases with the song and she is nominated for an award of best female singer.Insia requests Shakti to fix a meeting with her and the lawyer. Reluctantly, Shakti fixes a date the following week. Insia meets the lawyer, who gives her some advice and files for signatures. Once home, her mother scolds her for going to Mumbai without informing anyone. She tells her she can't divorce Farookh as they would have no financial support otherwise. Angry at her mother's refusal, Insia throws a tantrum, but her grandmother reveals how Farookh had wanted to kill her before she was born, and how Najman has struggled to keep Insia alive. Farookh soon reveals that he has got a job in Saudi Arabia, which relieves Insia, as she would have to endure her father only a month a year, but her happiness is short-lived as Farookh tells her that he has fixed Insia's marriage to a Saudi boy and will take his entire family there. He buys tickets for Saudi in order to leave on the day Insia's final examination is over. Chintan and Shakti try to convince Insia to stay, but learning of her mother's efforts to keep her alive, Insia tells them she has no choice.On the final day of school, Insia and Chintan spend their last joyful moments together. Chintan reveals that he is going for the award ceremony, and is going to cheer when Secret Superstar wins, but feels dejected that Insia won't come. Insia and her family leave for Saudi Arabia. At the airport's baggage counter, the clerk tells Farookh that they have one extra bag. Farookh scolds Najma for carrying the guitar and tells Insia to throw it away. For the first time, Najma protests against Farookh as she sees Insia break down in tears. When Farookh threatens to slap her in front of everybody, Najma signs the divorce papers, hands them to Farookh and marches out of the airport. She tells Insia to call Shakti so that they can arrive at the award ceremony. Shakti and Chintan are delighted to see Insia, who is still hiding her identity.Unforutunately, Secret Superstar does not win the award. But the winner, Monali Thakur, says that she feels she does not deserve the award because she believes that Secret Superstar is a better singer than her and invites her to come to the stage and take the award. Insia reveals her identity on live television, and dedicates her award to Najma.", "language": ["Hindi"], "release_date": "18 October 2017", "viewer_count": "10833"}, {"movie_name": "Ittefaq", "movie_year": "2017", "actors": ["Sidharth Malhotra", "Sonakshi Sinha", "Akshaye Khanna"], "director": "Abhay Chopra", "writers": ["Abhay Chopra", "Shreyas Jain"], "genres": ["Mystery", "Thriller"], "review_rating": "7.2", "keywords": "null", "user_review_count": "59", "critic_review_count": "19", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Hindi"], "release_date": "3 November 2017", "viewer_count": "5787"}, {"movie_name": "Shaadi Mein Zaroor Aana", "movie_year": "2017", "actors": ["Rajkummar Rao", "Kriti Kharbanda", "K.K. Raina"], "director": "Ratnaa Sinha", "writers": ["Kamal Pandey"], "genres": ["Drama", "Family", "Romance"], "review_rating": "7.9", "keywords": "null", "user_review_count": "71", "critic_review_count": "7", "synopsis": "Satyendra Mishra aka Sattu (Rajkummar Rao) a clerk in income tax department and Aarti Shukla (Kriti Kharbanda), an ambitious college topper, meet for a proposed arranged marriage and fall in love in the process. On the night of their marriage, Aarti got to know that she has passed her civil service exam, and she can become an officer, but as per her sister's conversation with Sattu's family she came to know, she will not be allowed to work after her marriage, so in the dilemma of pursuing her dream or to marry her love and sacrifice it, she decided to choose to run away from the marriage and become an officer. Sattu was left shocked and with his family, mother father uncle and sister completely broken down due to the incident.After the interval, story takes an angle of revenge. Aarti a sub-registrar, after 4 years of service, gets temporary suspended due to accusation of taking bribe of 3 crore, for selling un used government property for public construction, Senior IAS officer, Satyendra Mishra, takes the case for investigation in his hands, and starts the enquiry. Satyendra starts the enquiry, questioning all parties involved in the case. Aarti feels mentally tortured, since she feels Satyendra is taking revenge on her and tries to explain the marriage night incidence was not a selfish act but an act out of hurry, and she regrets about it with the hope that Satyendra will drop the case, but Satyendra keeps his investigation going and gets her arrested. Next day, he presents the case to the jury, with a video as an evidence. Which shows that Aarti's friend and personal assistant Nirmala, actually cheated her and got all the government property paper signed by aarti, without her awareness. So Aarti is found not guilty and gets acquitted. And later is revealed that, Satyendra put Aarti in custody, to protect her, not as a revenge.Aarti, realizes she hurt Satyendra and still he protects her, and feels he still loves him. But due to his ego is not able to accept that. She starts persuading Satyendra (sattu) to marry her, but he had decided not to get marry again, after the mishap. Aarti feels really upset, then with her family and Sattu's family, schemes a plan of fake marriage of her with Sharad (Aarti's Brother-in-law), to make Satyendra, jealous and that would make him accept his love for Aarti and marry her.\nPlan succeeds and in the climax, Satyendra accepts his love for Aarti, and gets married.", "language": ["Hindi"], "release_date": "10 November 2017", "viewer_count": "6026"}, {"movie_name": "Padman", "movie_year": "2018", "actors": ["Akshay Kumar", "Radhika Apte", "Sonam Kapoor"], "director": "R. Balki", "writers": ["R. Balki", "Swanand Kirkire"], "genres": ["Biography", "Comedy", "Drama"], "review_rating": "8.3", "keywords": ["sanitary pads", "biopic", "cotton", "one word title", "superhero"], "user_review_count": "59", "critic_review_count": "33", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Hindi"], "release_date": "9 February 2018", "viewer_count": "6063"}, {"movie_name": "Sonu Ke Titu Ki Sweety", "movie_year": "2018", "actors": ["Kartik Aaryan", "Nushrat Bharucha", "Sunny Singh Nijjar"], "director": "Luv Ranjan", "writers": ["Rahul Mody", "Luv Ranjan"], "genres": ["Comedy", "Romance"], "review_rating": "7.4", "keywords": "null", "user_review_count": "69", "critic_review_count": "10", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Hindi"], "release_date": "23 February 2018", "viewer_count": "7449"}, {"movie_name": "Theeran Adhigaaram Ondru", "movie_year": "2017", "actors": ["Karthi", "Rakul Preet Singh", "Abhimanyu Singh"], "director": "H. Vinoth", "writers": ["H. Vinoth"], "genres": ["Action", "Crime", "Thriller"], "review_rating": "8.4", "keywords": ["murder", "highway", "police investigation", "fight", "chase"], "user_review_count": "19", "critic_review_count": "6", "synopsis": "The film begins with a scene from a police station where the police officer Sasi in charge orders that the documented criminal cases in the form of manuscripts be converted into digital format. During this process he comes across a really spine chilling dacoity murder case from several years ago. After reading the case history he calls up the police officer who had taken charge of the case, Theeran Thirumaran (Karthi). The story shifts to the year of 1999, where Theeran is in his police training college undergoing training to be posted as DSP from TNPSC (Tamil Nadu Public Service Commission) exams. He tops the training period. Simultaneously in a house along the highway of Tamil Nadu a group of dacoits wreck the house by barging in killing all the people inside gruesomely and taking the belongings.Meanwhile Theeran returns to his hometown of Tanjavur falls in love with his new neighbour Priya (Rakul Preet Singh) and marries her. Later Theeran becomes known in the police department for his ways of handling various cases and he is later moved to Ponneri after a dacoital attack. Police Inspector Satya (Bose Venkat) and Theeran both handle the case but lead nowhere with the case. Therefore in 2003 Theeran and Sathya and a group of other police officers go around India to see if they are able to identify the fingerprints of the dacoits. During this process Theeran learns that these dacoits are actually tribe members of the left over cultural groups after the Indian Independence. They are eventually stopped by the carelessness of their superior officers and the case is put on hold.Later in 2003 the dacoits raid the house of the ruling party's MLA and kill him. The government is under heavy pressure from the public and the Home Minister gives Theeran all powers and a full team to nab the dacoits. A year later they find one fingerprint match in Uttar Pradesh prison and go to a lorry station to capture the dacoit. Learning that the lorry has left and it is heading to Ponneri Theeran and the other officers rush to stop them. This time the dacoits raid Sathya's house killing his wife and eventually injuring Priya putting her in a coma.Angered by this incident Theeran with the help of higher officials puts together a team to capture the gang of dacoits lead by Oma (Abhimanyu Singh). They camp in Rajasthan with the help of a local police officer. They come to know that the gang members except Oma are in their village so they visit the village only to be sent out by the villagers. While the case is going on Theeran learns that Priya has gone into a critical state and an operation is required. This fuels Theeran's anger which makes him even more motivated to find Oma. The team learns that there is a way to bring Oma out from his village. So he captures the organizer of the gang and captures one of the gang members and puts them in police custody. Infuriated Oma vows to kill Theeran and his team. Theeran gets information that Oma will be on a train which is infiltrated by the team but Oma escapes to a nearby village. Theeran and his team walk to the village and reside there for the night. Oma's gang infiltrate the village destroying it and killing Theeran's teammates. Finally Theeran captures Oma brings him to Tamil Nadu and gets him a death sentence.Now in 2017 it is revealed that Theeran has a boring useless post in the Traffic Vigilance Department because he is straightforward and lives alone after the death of Priya. Theeran is visited by Sathya, Sathya's daughter and Sasi. Sasi salutes him and the movie ends with a note conveying \"The film is dedicated to all the people in the police department who fought and arrested those dacoits and we thank them for their bravery and courage\". The note also states that \"The officers involved in this case were not recognized by the government by providing any honorary awards neither were they promoted to higher posts\".", "language": ["Tamil", "Telugu"], "release_date": "17 November 2017", "viewer_count": "3940"}, {"movie_name": "Vikram Vedha", "movie_year": "2017", "actors": ["Madhavan", "Vijay Sethupathi", "Shraddha Srinath"], "director": "Gayatri,", "writers": ["Manikandan", "Gayatri"], "genres": ["Action", "Crime", "Thriller"], "review_rating": "8.9", "keywords": ["gangster", "fight", "gunfight", "shootout", "sledgehammer"], "user_review_count": "60", "critic_review_count": "15", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Tamil", "Hindi"], "release_date": "21 July 2017", "viewer_count": "11397"}, {"movie_name": "Iravukku Aayiram Kangal", "movie_year": "2018", "actors": ["Ajmal Ameer", "Anandraj", "Arulnithi"], "director": "Mu. Maran", "writers": ["Ajmal Ameer", "Anandraj", "Arulnithi"], "genres": ["Action", "Thriller"], "review_rating": "8.0", "keywords": "null", "user_review_count": "0", "critic_review_count": "2", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Tamil"], "release_date": "11 May 2018", "viewer_count": "28"}, {"movie_name": "Irumbu Thirai", "movie_year": "2018", "actors": ["Arjun", "Vincent Ashokan", "Delhi Ganesh"], "director": "P.S. Mithran", "writers": ["P.S. Mithran"], "genres": ["Action", "Thriller"], "review_rating": "8.1", "keywords": ["techno thriller", "tamil", "hollywood california"], "user_review_count": "0", "critic_review_count": "1", "synopsis": "It looks like we don't have a Synopsis for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Synopsis submission guide.", "language": ["Tamil"], "release_date": "11 May 2018", "viewer_count": "175"}]